{
    "link": "https://www.wikihow.com/Make-Out",
    "article": "How to Make Out",
    "intro": "While kissing someone you like for even a few seconds can be electrifying or intense enough on its own, making out takes kissing to a new level. If you want to improve your next make out session, we've got a tutorial full of tips to help you sustain the passion, mix things up, and make your kissing partner feel appreciated. Whether you've been with the same person for a while or you're ",
    "points": [
        {
            "name": "Initiating the Make Out Session",
            "steps": [
                {
                    "step": "5",
                    "title": "Remember to come up for air.",
                    "subtitle": " Taking a little break from kissing is perfectly fine and can even help get you back into the kissing mindset. If you're tired but don't want to stop yet, just come up for air, slow down your kissing pace, or don't be afraid to take a quick bathroom break or ask for a glass of water. If you're not feeling comfortable with so much kissing, then you won't be able to enjoy yourself or give your best effort.",
                    "sub-points": [
                        "It's okay. Taking a break from time to time will make you a better kisser."
                    ]
                }
            ]
        },
        {
            "name": "Keeping Things Interesting",
            "steps": [
                {
                    "step": "7",
                    "title": "Keep mixing things up.",
                    "subtitle": " The most important thing to keep in mind as you make out is to keep things interesting by trying something new every once in a while. Just sitting there with your hands in the same position, kissing in the same way, will get old fast. So, mix things up between pecks on the lips, gentle love bites, passionate French kissing, and doing whatever else you need to do to keep things interesting.",
                    "sub-points": [
                        "You don't have to try 10,000 new moves in the middle of a make-out session. But trying at least two or three different things can help spice things up."
                    ]
                }
            ]
        },
        {
            "name": "Winding Down",
            "steps": [
                {
                    "step": "3",
                    "title": "Leave your kissing partner wanting more.",
                    "subtitle": " As you finish up the make-out session, you should make sure that there's a repeat on the horizon. When you're done kissing, you should still stay sexy, be affectionate, and leave your kissing partner wanting more. You can say you can't wait to hang out again when you say goodbye, or even send a cute text saying what a great time you had earlier.",
                    "sub-points": [
                        "Though it may be hard to stay in the mood forever, try to keep things sexy for as long as you can after the make-out session. That will make your kissing partner even more eager to see you again."
                    ]
                }
            ]
        }
    ]
}