{
    "link": "https://www.wikihow.com/Breaking-Glass-Meaning",
    "article": "What Is the Spiritual Meaning of Broken Glass?",
    "intro": "Breaking glass has great spiritual significance across many cultures, from Jewish wedding ceremonies to Pakistani superstitions. It can be an omen of good or bad luck, but is most often seen as a spiritual message to clear your mind and move forward. We’ll fill you in on the common meanings of broken glass, as well its meaning in the Bible, feng shui, your dreams, and other contexts.",
    "points": [
        {
            "name": "Spiritual Meanings of Breaking Glass",
            "steps": [
                {
                    "step": "6",
                    "title": "You’re entering a new stage of your life.",
                    "subtitle": " Glass objects are beautiful until they break, but even then they can be recycled or remade into something new. This cycle reminds us that life itself happens in phases, and just because one phase is ending doesn’t mean the next will be painful. You may be starting a new relationship, entering a new career, or even moving homes. This sign is here to tell you to embrace that change.",
                    "sub-points": [
                        " Learn to  by focusing on the positives of your new situation. Look for new opportunities you may not have had before, or remind yourself that change is necessary to grow as a person."
                    ]
                }
            ]
        },
        {
            "name": "Is breaking glass good or bad luck?",
            "steps": [
                {
                    "step": "None",
                    "title": "Breaking glass is often seen as an omen of good luck.",
                    "subtitle": " It’s true that some say broken mirrors are bad luck, but not all broken glass is a bad omen. Broken glass is often a sign of release or freedom, and likewise often signifies good things coming your way. In fact, in Pakistani tradition, a glass accidentally breaking in your house is a definite sign of your luck taking a turn for the better.",
                    "sub-points": [
                        " While waiting for good luck,  in the meantime by looking for ways to turn bad situations into positive ones. For example, if your favorite restaurant is closed, use the opportunity to try a new place—you just might find a new favorite!",
                        "Note that you can’t make your own good luck by purposefully breaking a glass; it has to be an accident for the energy to be positive!"
                    ]
                },
                {
                    "step": "None",
                    "title": "Breaking glass is often seen as an omen of good luck.",
                    "subtitle": " It’s true that some say broken mirrors are bad luck, but not all broken glass is a bad omen. Broken glass is often a sign of release or freedom, and likewise often signifies good things coming your way. In fact, in Pakistani tradition, a glass accidentally breaking in your house is a definite sign of your luck taking a turn for the better.",
                    "sub-points": [
                        " While waiting for good luck,  in the meantime by looking for ways to turn bad situations into positive ones. For example, if your favorite restaurant is closed, use the opportunity to try a new place—you just might find a new favorite!",
                        "Note that you can’t make your own good luck by purposefully breaking a glass; it has to be an accident for the energy to be positive!"
                    ]
                }
            ]
        },
        {
            "name": "Breaking Glass in Jewish Tradition",
            "steps": [
                {
                    "step": "2",
                    "title": "The breaking of the glass recalls the destruction of the Temple.",
                    "subtitle": " Nowadays, the original meaning has changed to commemorate the destruction of the Temple in Jerusalem in 70 A.D., when the Romans claimed the city. It’s done to remind wedding-goers that, even during a joyous event, they shouldn’t forget all that their people have endured.",
                    "sub-points": [
                        "The breaking of the glass also reminds wedding attendees and the married couple that the world itself is imperfect and broken, and to keep that in mind as they venture into this new chapter of their lives."
                    ]
                }
            ]
        },
        {
            "name": "Broken Glass in the Bible",
            "steps": [
                {
                    "step": "None",
                    "title": "Broken glass symbolizes impurity in the Bible.",
                    "subtitle": " Revelation 21 describes a great city with streets like transparent glass. 1 Corinthians 13 uses the image of a mirror to describe the act of seeing the truth clearly. Throughout the Bible, glass is used in this way as a symbol of clarity and purity. Broken glass, then, might be seen as a symbol of the impure, or of sin.",
                    "sub-points": [
                        "If you encounter broken glass, take care to  by keeping your mind on God."
                    ]
                }
            ]
        },
        {
            "name": "Broken Glass in Feng Shui",
            "steps": [
                {
                    "step": "None",
                    "title": "Broken glass is said to bring negative energy in feng shui.",
                    "subtitle": " According to some feng shui experts, having a broken mirror in your home means 7 years of bad luck. A broken window, too, is bad news. It’s said that windows offer a clear perspective of the outside world, but a broken or foggy window obscures that view and invites negative energies.",
                    "sub-points": [
                        "Broken objects in general are said to bring bad energies into your home, according to feng shui, and so remove them from you home as soon as possible to preserve the good energy."
                    ]
                }
            ]
        },
        {
            "name": "Meaning of Broken Glass in Dreams",
            "steps": [
                {
                    "step": "3",
                    "title": "Broken windows or other glass",
                    "subtitle": " Seeing a broken window or other shattered glass may mean you need to be more forthcoming or open to your emotions. The transparent glass represents your own transparency—how well you reveal your feelings. When you keep your negative emotions bottled up inside they risk overflowing, or worse, shattering the vessel. It’s time to wear your heart on your sleeve a bit.",
                    "sub-points": [
                        " in a healthy way by explaining them to a trusted friend or family member. Or, write them down in a journal to externalize them, which can help vent your frustration or sadness."
                    ]
                }
            ]
        }
    ]
}