{
    "link": "https://www.wikihow.com/Tell-if-a-Mirror-Is-Two-Way-or-Not",
    "article": "How to Tell if a Mirror Is Two Way or Not",
    "intro": "Have you ever been in a bathroom, dressing room, or another private area with a mirror and had that feeling that someone is watching you? You can check to see if a mirror is transparent by observing how it is installed and using a few simple techniques to determine if there's a wall behind it. You may have heard about the fingernail test but there are more accurate ways to tell if a mirror is two-way or not.",
    "points": [
        {
            "name": "Considering the Location",
            "steps": [
                {
                    "step": "3",
                    "title": "Consider where you are.",
                    "subtitle": " If you're in a public place and in an area where you'd expect privacy, such as a restroom, it's unlikely and  to have a two-way mirror. On the other hand, two-way mirrors are frequently used by law enforcement. For example, two-way mirrors are used in interrogation rooms and for lineups.",
                    "sub-points": [
                        "The use of two-way mirrors is closely tied to issues of personal privacy and Constitutional rights. Most states have passed additional legislation preventing the use of two-way mirrors in rest rooms, locker rooms, showers, fitting rooms, and hotel rooms. For example, according to the 2006 New York Code, if a location in that state has chosen to use two-way mirrors for surveillance, they are required to post signs that notify you.",
                        "Many places, such as gas stations, will use one-way metal mirrors because glass mirrors can be destroyed by users. If the mirror in question is metal, then it is not a two-way mirror."
                    ]
                },
                {
                    "step": "3",
                    "title": "Consider where you are.",
                    "subtitle": " If you're in a public place and in an area where you'd expect privacy, such as a restroom, it's unlikely and  to have a two-way mirror. On the other hand, two-way mirrors are frequently used by law enforcement. For example, two-way mirrors are used in interrogation rooms and for lineups.",
                    "sub-points": [
                        "The use of two-way mirrors is closely tied to issues of personal privacy and Constitutional rights. Most states have passed additional legislation preventing the use of two-way mirrors in rest rooms, locker rooms, showers, fitting rooms, and hotel rooms. For example, according to the 2006 New York Code, if a location in that state has chosen to use two-way mirrors for surveillance, they are required to post signs that notify you.",
                        "Many places, such as gas stations, will use one-way metal mirrors because glass mirrors can be destroyed by users. If the mirror in question is metal, then it is not a two-way mirror."
                    ]
                }
            ]
        },
        {
            "name": "Examining the Mirror",
            "steps": []
        }
    ]
}