{
    "link": "https://www.wikihow.com/Take-Care-of-Crayfish",
    "article": "How to Take Care of Crayfish",
    "intro": "Crayfish, also known as crawfish, crawdads, and mudbugs, are freshwater crustaceans that can easily be kept in a home aquarium. All you need to raise one of your own is a roomy tank, the right kind of food, time, and attention. Crayfish make excellent pets, and can often be seen building little hills, mounds, digging, hiding among shadowy rocks and plants, and burrowing in the gravel at the bottom of their tanks.",
    "points": [
        {
            "name": "Setting up Your Crayfish’s Tank",
            "steps": [
                {
                    "step": "5",
                    "title": "Incorporate a few natural environmental features.",
                    "subtitle": " Add elements like rocks, water plants, or lengths of PVC pipe to the bottom of your tank. That way, your crayfish will have a place to play, burrow, or hide away for a while. Large structures like hollow rocks, gerbil tubes, or enclosed containers are particularly good for making crayfish feel safe, especially during their vulnerable shedding period.",
                    "sub-points": [
                        "Shut off any surrounding light sources or keep one side of the tank covered to minimize the amount of light that gets in. Crayfish like it dark."
                    ]
                }
            ]
        },
        {
            "name": "Feeding Your Crayfish",
            "steps": [
                {
                    "step": "3",
                    "title": "Avoid overfeeding your crayfish.",
                    "subtitle": " One or two shakes of shrimp pellets or a smattering of vegetables per day should be more than enough to keep your crayfish satisfied. Remove any uneaten portions of food soon after feeding your crayfish. Anything left sitting at the bottom of the tank will quickly decompose, dirtying the water and making more frequent changes necessary.",
                    "sub-points": [
                        "If you're caring for more than one crayfish (which isn’t recommended), it’s okay to double the amount of food you administer. Still, keep an eye out for leftovers and scoop them out whatever remnants you find quickly.",
                        "Overeating can actually be bad for crayfish, as it causes their exoskeletons to become soft and weak."
                    ]
                },
                {
                    "step": "3",
                    "title": "Avoid overfeeding your crayfish.",
                    "subtitle": " One or two shakes of shrimp pellets or a smattering of vegetables per day should be more than enough to keep your crayfish satisfied. Remove any uneaten portions of food soon after feeding your crayfish. Anything left sitting at the bottom of the tank will quickly decompose, dirtying the water and making more frequent changes necessary.",
                    "sub-points": [
                        "If you're caring for more than one crayfish (which isn’t recommended), it’s okay to double the amount of food you administer. Still, keep an eye out for leftovers and scoop them out whatever remnants you find quickly.",
                        "Overeating can actually be bad for crayfish, as it causes their exoskeletons to become soft and weak."
                    ]
                }
            ]
        },
        {
            "name": "Keeping Your Crayfish Safe",
            "steps": [
                {
                    "step": "3",
                    "title": "Keep your tank covered to make sure your crayfish doesn’t get out.",
                    "subtitle": " Crayfish are natural explorers, which means they can turn into little escape artists when no one is looking. Ideally, you should opt for a tank with a removable lid to guarantee that your cray stays confined. If that’s not an option, use small pieces of sponges to seal off any openings near the top of the tank, especially around the filter. Don't use pieces of plastic, or aluminum foil, which that will be harmful to crays if they eat it. ",
                    "sub-points": [
                        "Be vigilant about blocking off all potential escape routes. If your crayfish manages to find a way out of its tank, it can dehydrate and die in just a few hours.",
                        "Never put a runaway crayfish back in its tank immediately. Instead, place it in a shallow container with just enough water to cover it. Its gills will need time to get acclimated to the water again—otherwise, it can actually drown when fully submerged."
                    ]
                },
                {
                    "step": "3",
                    "title": "Keep your tank covered to make sure your crayfish doesn’t get out.",
                    "subtitle": " Crayfish are natural explorers, which means they can turn into little escape artists when no one is looking. Ideally, you should opt for a tank with a removable lid to guarantee that your cray stays confined. If that’s not an option, use small pieces of sponges to seal off any openings near the top of the tank, especially around the filter. Don't use pieces of plastic, or aluminum foil, which that will be harmful to crays if they eat it. ",
                    "sub-points": [
                        "Be vigilant about blocking off all potential escape routes. If your crayfish manages to find a way out of its tank, it can dehydrate and die in just a few hours.",
                        "Never put a runaway crayfish back in its tank immediately. Instead, place it in a shallow container with just enough water to cover it. Its gills will need time to get acclimated to the water again—otherwise, it can actually drown when fully submerged."
                    ]
                }
            ]
        }
    ]
}