{
    "link": "https://www.wikihow.com/Psychological-Effects-of-False-Accusations-in-a-Relationship",
    "article": "How False Accusations in a Relationship Impact Your Mental Health",
    "intro": "Healthy relationships are built on trust. When a partner falsely accuses the other of bad behavior, that trust can be shaken, causing major psychological effects on the accused. But what are those effects, and how do you know if they’re happening to you? If you’re asking yourself these questions, we’re here to help. This guide outlines the most common psychological effects of false accusations in relationships. Read on to learn what these effects are, why they occur, and how to respond if a partner makes false accusations against you.",
    "points": [
        {
            "name": "Effects of Being Falsely Accused by a Partner ",
            "steps": [
                {
                    "step": "9",
                    "title": "Feeling Unsafe",
                    "subtitle": " You sometimes worry for your safety, or your family’s. Your partner may intimidate you by yelling, throwing objects, or threatening you. They may have acted violently towards you or others in the past. You fear that they might physically harm you, your children, or someone else in your household.",
                    "sub-points": [
                        "Your partner may also invade your privacy by looking through your phone or refusing to let you leave the house alone."
                    ]
                }
            ]
        },
        {
            "name": "Why would a partner make false accusations? ",
            "steps": [
                {
                    "step": "4",
                    "title": "They may be struggling with trauma or mental health issues.",
                    "subtitle": " For instance, if your partner has been cheated on in previous relationships, they might assume you’ll cheat on them as well. They may also have an anxious attachment style—meaning that they struggle to trust people due to having been mistreated earlier in life.",
                    "sub-points": [
                        "In rare cases, paranoid or delusional thinking is a symptom of certain mental health disorders. People with these disorders may sincerely believe things that aren’t true."
                    ]
                }
            ]
        },
        {
            "name": "How to Respond to False Accusations in a Relationship ",
            "steps": [
                {
                    "step": "7",
                    "title": "Seek support if you are experiencing domestic violence.",
                    "subtitle": " Reach out to a trusted friend, family member, or neighbor, if you’re comfortable doing so. If not, contact a healthcare provider or contact the National Domestic Violence Hotline to be connected with resources and people who can assist you.",
                    "sub-points": [
                        "Call 800-799-7233 to reach the National Domestic Violence Hotline.",
                        "Call 911 if you’re in danger, or you’re being threatened or stalked."
                    ]
                },
                {
                    "step": "7",
                    "title": "Seek support if you are experiencing domestic violence.",
                    "subtitle": " Reach out to a trusted friend, family member, or neighbor, if you’re comfortable doing so. If not, contact a healthcare provider or contact the National Domestic Violence Hotline to be connected with resources and people who can assist you.",
                    "sub-points": [
                        "Call 800-799-7233 to reach the National Domestic Violence Hotline.",
                        "Call 911 if you’re in danger, or you’re being threatened or stalked."
                    ]
                }
            ]
        }
    ]
}