{
    "link": "https://www.wikihow.com/Get-Into-a-Casual-Relationship",
    "article": "How to Have a Casual Relationship",
    "intro": "A casual relationship can help you create a bond with someone without the commitment, emotional investment, and demands of a romantic, long-term relationship. It is a great way to enjoy someone’s company while learning more about yourself, your likes and dislikes, and what you may need in future relationships. Although a casual relationship is non-exclusive, participants should still take care to set boundaries, support open communication, and be respectful of one another.",
    "points": [
        {
            "name": "Find someone who wants to be in a casual relationship.",
            "steps": [
                {
                    "step": "None",
                    "title": "If you have a friend or acquaintance who you are comfortable with, consider approaching that person.",
                    "subtitle": " Tell this potential partner that you aren’t looking for anything serious, but you would like to spend some time with them one-on-one. Be respectful and understanding if this person declines.",
                    "sub-points": [
                        "There are numerous dating websites and apps that can help you find someone who is on the same page as you are. Be yourself on these websites, and be honest about what you are looking for. Always stay safe and let a friend know if and when you meet a potential partner for the first time."
                    ]
                }
            ]
        },
        {
            "name": "Be honest.",
            "steps": [
                {
                    "step": "None",
                    "title": "Communication is the key to success in any relationship.",
                    "subtitle": " Casual relationships are no exception! It is important to be upfront and honest about what each of you are looking for in a causal relationship. If you want companionship, intimacy, or simply someone to go to a museum or a movie with you, let your potential partner know. Encourage your partner to communicate their wants, needs, and expectations with you, and promise to continue the open line of communication.",
                    "sub-points": [
                        "Say to your partner, “I really enjoy spending time with you, but I am not looking for a commitment or a relationship. Is this something you are comfortable with?”",
                        " We asked 326 wikiHow readers to tell us the best way to set boundaries in a casual relationship, and  agreed that  are key to maintaining a healthy, fun dynamic. "
                    ]
                },
                {
                    "step": "None",
                    "title": "Communication is the key to success in any relationship.",
                    "subtitle": " Casual relationships are no exception! It is important to be upfront and honest about what each of you are looking for in a causal relationship. If you want companionship, intimacy, or simply someone to go to a museum or a movie with you, let your potential partner know. Encourage your partner to communicate their wants, needs, and expectations with you, and promise to continue the open line of communication.",
                    "sub-points": [
                        "Say to your partner, “I really enjoy spending time with you, but I am not looking for a commitment or a relationship. Is this something you are comfortable with?”",
                        " We asked 326 wikiHow readers to tell us the best way to set boundaries in a casual relationship, and  agreed that  are key to maintaining a healthy, fun dynamic. "
                    ]
                }
            ]
        },
        {
            "name": "Plan how often to see one another.",
            "steps": []
        },
        {
            "name": "Discuss how to stay in touch.",
            "steps": []
        },
        {
            "name": "Choose if the relationship should be private or public.",
            "steps": []
        },
        {
            "name": "Decide how to end things.",
            "steps": []
        },
        {
            "name": "Be respectful.",
            "steps": []
        },
        {
            "name": "Plan fun, friendly activities instead of dates.",
            "steps": [
                {
                    "step": "None",
                    "title": "Go rock climbing, go to a concert, or play pub trivia with your partner.",
                    "subtitle": " Planning fun, lively activities is a great way to enjoy one another’s company without worrying about possible romantic implications. Active dates are a great way to enjoy time with your partner, and the help keep any level of seriousness at bay.",
                    "sub-points": [
                        "Try introducing the person to your friends and invite them to participate in activities with your friend-group, such as going to the movies or going bowling."
                    ]
                }
            ]
        },
        {
            "name": "Avoid romance.",
            "steps": [
                {
                    "step": "None",
                    "title": "This is important for maintaining the boundaries of a causal relationship.",
                    "subtitle": " Romantic getaways, candle-lit dinners, going to weddings, or celebrating anniversaries can, over time, promote feelings of affection and deep connection. To maintain the no-strings-attached policy, it is best to avoid situations that could encourage romantic feelings to grow.",
                    "sub-points": [
                        "Discuss if there are any holidays or celebrations that the two of you are comfortable celebrating together, such as a birthday or a promotion at work. It may be that you agree to avoid all celebrations and personal milestones completely."
                    ]
                }
            ]
        },
        {
            "name": "Keep conversations lighthearted.",
            "steps": [
                {
                    "step": "None",
                    "title": "In a romantic relationship, it is typical for couples to tackle serious, difficult issues and topics.",
                    "subtitle": " In a casual relationship, the obligation to sort through the heavy emotions isn’t there. You don’t necessarily need to omit sharing personal details and stories from conversations with your partner, but avoiding deep, personal conversations may help maintain the level of simplicity. Discuss with your partner about how you two should approach more serious conversations and situations.",
                    "sub-points": [
                        "Conversations can be current and cheerful. Discuss books, movies, sports, current events—topics that are interesting but fun and don’t require a level of seriousness. “Did you see the football game last night? I can’t believe they won at the very last second!”"
                    ]
                }
            ]
        },
        {
            "name": "Set boundaries for physical intimacy.",
            "steps": []
        },
        {
            "name": "Keep track of your emotions.",
            "steps": [
                {
                    "step": "None",
                    "title": "Although you wish to be in casual relationship, acknowledge that you may not always feel that way.",
                    "subtitle": " Spending time with someone may spark romantic feelings no matter how often you tell yourself you do not want to be emotionally invested. Remember that this is okay. Make it a point to check in regularly with the other person and make sure that the current setup is still working for them. This conversation may easily be something you avoid for a long period of time because it's uncomfortable. Be honest with yourself, and notice if your feelings for your partner begin to grow into something more serious.",
                    "sub-points": [
                        "Discuss this possibility with your partner at the beginning of the relationship. Acknowledge that you or your partner may develop romantic feelings, and agree on a method for handling this situation should it arise. Perhaps you will agree to end things without a discussion, or perhaps you will agree to have a conversation about it but will end things soon after. Decide what is most comfortable for you and your partner.",
                        "Your partner may develop feelings for you that you do not share. If this happens, continue to be open and honest with your partner about your wants and needs. Do not give your partner false hope, but do let them down easily and respectfully."
                    ]
                },
                {
                    "step": "None",
                    "title": "Although you wish to be in casual relationship, acknowledge that you may not always feel that way.",
                    "subtitle": " Spending time with someone may spark romantic feelings no matter how often you tell yourself you do not want to be emotionally invested. Remember that this is okay. Make it a point to check in regularly with the other person and make sure that the current setup is still working for them. This conversation may easily be something you avoid for a long period of time because it's uncomfortable. Be honest with yourself, and notice if your feelings for your partner begin to grow into something more serious.",
                    "sub-points": [
                        "Discuss this possibility with your partner at the beginning of the relationship. Acknowledge that you or your partner may develop romantic feelings, and agree on a method for handling this situation should it arise. Perhaps you will agree to end things without a discussion, or perhaps you will agree to have a conversation about it but will end things soon after. Decide what is most comfortable for you and your partner.",
                        "Your partner may develop feelings for you that you do not share. If this happens, continue to be open and honest with your partner about your wants and needs. Do not give your partner false hope, but do let them down easily and respectfully."
                    ]
                }
            ]
        },
        {
            "name": "Don’t disappear.",
            "steps": []
        },
        {
            "name": "Be sincere if your feelings change.",
            "steps": []
        },
        {
            "name": "Decide if the two of you should be friends.",
            "steps": [
                {
                    "step": "None",
                    "title": "Perhaps you both agree for a clean break and agree to end all communication.",
                    "subtitle": " Or, perhaps the two of you formed a great bond and wish to continue to keep in touch as friends. Recognize that the transition from a casual relationship to friendship can be complex and take time. Listen to your instincts and decide what would be best for you as you move away from the casual relationship.",
                    "sub-points": [
                        "Be sure that you are really interested in maintaining a friendship. Ask yourself if you would mind seeing your partner with someone else.",
                        "Consider if you or your partner ended things because romantic feelings got in the way. It may be too complicated to maintain a friendship as it can could cause romantic feelings to grow stronger.",
                        "If you do decide to be friends, give yourself some time away from one another. Reach out when enough time has passed, and make plans to catch up in a public place."
                    ]
                },
                {
                    "step": "None",
                    "title": "Perhaps you both agree for a clean break and agree to end all communication.",
                    "subtitle": " Or, perhaps the two of you formed a great bond and wish to continue to keep in touch as friends. Recognize that the transition from a casual relationship to friendship can be complex and take time. Listen to your instincts and decide what would be best for you as you move away from the casual relationship.",
                    "sub-points": [
                        "Be sure that you are really interested in maintaining a friendship. Ask yourself if you would mind seeing your partner with someone else.",
                        "Consider if you or your partner ended things because romantic feelings got in the way. It may be too complicated to maintain a friendship as it can could cause romantic feelings to grow stronger.",
                        "If you do decide to be friends, give yourself some time away from one another. Reach out when enough time has passed, and make plans to catch up in a public place."
                    ]
                },
                {
                    "step": "None",
                    "title": "Perhaps you both agree for a clean break and agree to end all communication.",
                    "subtitle": " Or, perhaps the two of you formed a great bond and wish to continue to keep in touch as friends. Recognize that the transition from a casual relationship to friendship can be complex and take time. Listen to your instincts and decide what would be best for you as you move away from the casual relationship.",
                    "sub-points": [
                        "Be sure that you are really interested in maintaining a friendship. Ask yourself if you would mind seeing your partner with someone else.",
                        "Consider if you or your partner ended things because romantic feelings got in the way. It may be too complicated to maintain a friendship as it can could cause romantic feelings to grow stronger.",
                        "If you do decide to be friends, give yourself some time away from one another. Reach out when enough time has passed, and make plans to catch up in a public place."
                    ]
                }
            ]
        }
    ]
}