{
    "link": "https://www.wikihow.com/Do-Magic-Tricks",
    "article": "How to Perform Magic: 8 Tricks for Beginners",
    "intro": "Many magicians devote their entire lives to mastering the art of illusion, but you don't have to go to such great lengths to impress your friends and family. With the right know-how and a little practice, you can easily learn to perform a number of jaw-dropping tricks that are guaranteed to leave onlookers in awe! Start by perfecting a few simple beginner tricks, like making a pencil float in the palm of your hand or passing a cup through a solid tabletop. Then, work your way up to more difficult tricks, such as making a coin disappear and levitating. Read on to keep your audience spellbound with your repertoire of tricks!",
    "points": [
        {
            "name": "Simple Tricks for Beginners",
            "steps": [
                {
                    "step": "6",
                    "title": "Spin a straw around the top of a bottle using only your mind.",
                    "subtitle": " While no one is watching, take a paper-wrapped straw and rub your hand up and down its length a few times to generate static electricity. Be careful not to tear the thin paper wrapper. When you're ready to do the trick, lay the straw across the top of a bottle or another container with a narrow opening. Raise your hands over the ends of the straw and wave them forward and backward in a “mystical” way. The static charge will cause it to rotate without you ever actually touching it.",
                    "sub-points": [
                        "Keep your hands close to the straw at all times. If they get too far away, the static charge will be too faint to continue moving it.",
                        "If possible, perform the setup for this trick while your audience is absent or distracted (such as when your dining companion excuses themselves to go to the restroom)."
                    ]
                },
                {
                    "step": "6",
                    "title": "Spin a straw around the top of a bottle using only your mind.",
                    "subtitle": " While no one is watching, take a paper-wrapped straw and rub your hand up and down its length a few times to generate static electricity. Be careful not to tear the thin paper wrapper. When you're ready to do the trick, lay the straw across the top of a bottle or another container with a narrow opening. Raise your hands over the ends of the straw and wave them forward and backward in a “mystical” way. The static charge will cause it to rotate without you ever actually touching it.",
                    "sub-points": [
                        "Keep your hands close to the straw at all times. If they get too far away, the static charge will be too faint to continue moving it.",
                        "If possible, perform the setup for this trick while your audience is absent or distracted (such as when your dining companion excuses themselves to go to the restroom)."
                    ]
                }
            ]
        },
        {
            "name": "Making Yourself Levitate",
            "steps": [
                {
                    "step": "4",
                    "title": "Lower yourself back down to the ground.",
                    "subtitle": " Give them just a quick flash of what's happening and leave them reeling with surprise. By the time their minds begin processing what they've just seen, you'll have already moved on to your next trick or given a bow to finish your performance.",
                    "sub-points": [
                        "The longer you “float,” the more of a chance your audience will have to deduce that the trick is just an optical illusion and not a real magic trick."
                    ]
                }
            ]
        },
        {
            "name": "Making a Coin Disappear into Your Skin",
            "steps": [
                {
                    "step": "6",
                    "title": "Remove your hand to reveal that the coin has disappeared.",
                    "subtitle": " When it comes time for the big reveal and “payoff”, stop rubbing and leave your hand glued to your arm. Then, slowly remove your hand and turn it around for your audience to see. There, they'll see that you’re totally empty handed! It’ll be like you absorbed the coin into your skin. ",
                    "sub-points": [
                        "If you want to add some extra flourish, carefully transfer the coin back into your rubbing hand and “retrieve” it from one of your onlookers' ears, pockets, or shirt collars."
                    ]
                }
            ]
        }
    ]
}