{
    "link": "https://www.wikihow.com/Clean-Coins",
    "article": "Easy & Effective Ways to Clean Dirty Coins at Home",
    "intro": "Do you want to make the dull and dirty coins in your collection shine like they’re brand new again? Over the years, they can get coated in dirt, grime, and tarnish, but you can easily clean most coins at home with products you already have. Before you start scrubbing all your coins, there are a few things you should know. Keep reading to find the best household hacks for cleaning coins, and what you should do differently if they’re antique collectibles.",
    "points": [
        {
            "name": "Removing Tarnish from Coins",
            "steps": [
                {
                    "step": "7",
                    "title": "Dip coins in a commercial  for heavy tarnish.",
                    "subtitle": " Wear  and  when you use a cleaner solution since it’s very acidic. Hold 1 coin at a time between your fingers and submerge it in the cleaning solution for about 5 seconds. Take the coin out of the solution and immediately rinse the residue off with clean water.",
                    "sub-points": [
                        "The acidic cleaner strips the grime and tarnishes off the surface to make your coin look shiny."
                    ]
                }
            ]
        },
        {
            "name": "Basic Coin Cleaning",
            "steps": [
                {
                    "step": "4",
                    "title": "Dry off the coins with a towel.",
                    "subtitle": " Pat each coin gently with a lint-free towel to absorb all of the moisture. Make sure that each coin is completely dry so the metal doesn’t wear away over time.",
                    "sub-points": [
                        "Patting the coins will allow you to avoid creating micro-scratches with the material you are wiping it with."
                    ]
                }
            ]
        },
        {
            "name": "Caring for Collectible Coins",
            "steps": [
                {
                    "step": "3",
                    "title": "Store your coins in hard .",
                    "subtitle": " Set your coin inside of the plastic holder and snap it closed so nothing can get on the surface. Avoid opening the container after putting your coin away so it doesn’t get exposed to the environment around it.",
                    "sub-points": [
                        "Keep your coins in an album so you can easily look through them. If you have really valuable coins, keep them in a safe to protect them."
                    ]
                }
            ]
        }
    ]
}