{
    "link": "https://www.wikihow.com/Increase-Your-Income",
    "article": "How to Increase Your Income",
    "intro": "Are you looking to maximize every paycheck and squeeze as much as you can out of your income? With a few adjustments to your lifestyle and your finances, you'll be able to increase the amount of money you bring in every month and maintain a healthy income.",
    "points": [
        {
            "name": "Generating Extra Income",
            "steps": [
                {
                    "step": "3",
                    "title": ".",
                    "subtitle": " Think about skills or abilities that you can channel into a viable side business. This could be a gardening or landscaping side business, or a freelance writing business. Try to maximize your skills and turn them into a unique business. Keep in mind running your own business will require a significant time and money investment, in addition to your current job.",
                    "sub-points": [
                        "Starting your own business can be stressful and difficult to sustain, so you may want to retain your current job while you get your side business off the ground."
                    ]
                }
            ]
        },
        {
            "name": "Investing Your Money",
            "steps": [
                {
                    "step": "3",
                    "title": "Consider .",
                    "subtitle": " Penny stocks are publicly-traded stocks that have a very low price per share, usually under five dollars and sometimes less than a dollar. They are often issued by small, less established companies and can be purchased very cheaply. However, penny stocks can be risky investments because they are not traded on the major exchanges (NASDAQ or the NYSE) and it may be difficult to trade them once you purchase them.",
                    "sub-points": [
                        "Penny stocks are good for short term gains and not as long term investments. Before you invest in a company, you should investigate them online to determine if they are worth the stock purchase. You can then open an account with an online brokerage service and start purchasing and trading penny stock.",
                        "To make a profit with penny stocks, you will need to keep constant tabs on your stocks to make quick trades at the highest price. Be wary of “pump and dump” stocks, which are fraudulent stocks that are pumped up to a high stock price, enticing you to invest, only to take your money and leave you with a stock that has no real value."
                    ]
                },
                {
                    "step": "3",
                    "title": "Consider .",
                    "subtitle": " Penny stocks are publicly-traded stocks that have a very low price per share, usually under five dollars and sometimes less than a dollar. They are often issued by small, less established companies and can be purchased very cheaply. However, penny stocks can be risky investments because they are not traded on the major exchanges (NASDAQ or the NYSE) and it may be difficult to trade them once you purchase them.",
                    "sub-points": [
                        "Penny stocks are good for short term gains and not as long term investments. Before you invest in a company, you should investigate them online to determine if they are worth the stock purchase. You can then open an account with an online brokerage service and start purchasing and trading penny stock.",
                        "To make a profit with penny stocks, you will need to keep constant tabs on your stocks to make quick trades at the highest price. Be wary of “pump and dump” stocks, which are fraudulent stocks that are pumped up to a high stock price, enticing you to invest, only to take your money and leave you with a stock that has no real value."
                    ]
                }
            ]
        },
        {
            "name": "Cutting Down on Expenses",
            "steps": []
        },
        {
            "name": "When Should I Ask For a Raise?",
            "steps": []
        }
    ]
}