{
    "link": "https://www.wikihow.com/Verify-Cash-App",
    "article": "How to Verify Cash App: Identity, Account, Bitcoin, & More",
    "intro": "Is Cash App asking you to verify your account? If you've purchased Bitcoin or have money coming in and out of your account, verifying your identity can help protect your account. You can also verify any Bitcoin you purchased through the app. Here's everything you need to know about verifying on Cash App using your iPhone or Android.",
    "points": [
        {
            "name": "Verifying Your Identity",
            "steps": [
                {
                    "step": "5",
                    "title": "Wait for verification.",
                    "subtitle": " This process usually takes about 48 hours, though it could be longer if you had to supply more information.",
                    "sub-points": [
                        "To check your verification process, tap your profile icon, and then tap . Look for  in the  section."
                    ]
                }
            ]
        },
        {
            "name": "Verifying Your Bitcoin",
            "steps": []
        },
        {
            "name": "Getting a Verified $Cashtag",
            "steps": [
                {
                    "step": "None",
                    "title": "Currently, Cash App does not accept requests to verify $cashtags.",
                    "subtitle": " Verified $cashtags indicate an authentic presence, such as a public figure, brand, or celebrity. This user has a blue verification badge next to their $cashtag, which also appears in payment receipts, activity, and search results. ",
                    "sub-points": [
                        "If you have a verified $cashapp and change your name, email, or phone number, you'll need to be re-verified."
                    ]
                }
            ]
        },
        {
            "name": "What happens if I don't verify Cash App? ",
            "steps": [
                {
                    "step": "None",
                    "title": "Cash App may lock your account if you don't verify.",
                    "subtitle": " While you may be able to complete small transactions for some time, your account will eventually be flagged, and you'll be asked to verify your account. If you don't verify, you risk having your funds locked within your Cash App account balance.  ",
                    "sub-points": [
                        "Unverified accounts only have a $1,000 . Additionally, you can only send and receive up to $1,000 every 30-day period, with a total account limit of $1,500.",
                        "When your Cash App account is verified, you have an unlimited cash balance limit. You can also order a , purchase bitcoin/stocks, and  aged 13-17."
                    ]
                },
                {
                    "step": "None",
                    "title": "Cash App may lock your account if you don't verify.",
                    "subtitle": " While you may be able to complete small transactions for some time, your account will eventually be flagged, and you'll be asked to verify your account. If you don't verify, you risk having your funds locked within your Cash App account balance.  ",
                    "sub-points": [
                        "Unverified accounts only have a $1,000 . Additionally, you can only send and receive up to $1,000 every 30-day period, with a total account limit of $1,500.",
                        "When your Cash App account is verified, you have an unlimited cash balance limit. You can also order a , purchase bitcoin/stocks, and  aged 13-17."
                    ]
                }
            ]
        }
    ]
}