{
    "link": "https://www.wikihow.com/Change-a-Verb-to-a-Noun",
    "article": "How to Change a Verb to a Noun",
    "intro": "Many verbs in the English language can easily be converted into nouns with the addition of suffixes. You can also change certain verbs to nouns depending on the context of a sentence. Sometimes, using the noun form of a verb can sound clunky and jargon-heavy. Use your discretion when changing verbs to nouns to keep your writing clear and concise. While it can be a little tricky to change around words, especially if you're not a native speaker, don't get discouraged. With a little time and patience, you can get the hang of changing verbs to nouns.",
    "points": [
        {
            "name": "Adding Suffixes",
            "steps": [
                {
                    "step": "3",
                    "title": "Add \"-tion\" or \"-sion.\".",
                    "subtitle": " The suffixes \"-tion\" and \"-sion\" are found at the end of many nouns. A wide variety of verbs turn into nouns with these suffixes. For example, \"inform\", \"decide\", and \"describe\" can become \"information,\" \"decision,\" and \"description.\"",
                    "sub-points": [
                        "For example, look at the sentence, \"He decided to decline the job offer.\" If you wanted to use a noun, you could say, \"He made the decision to decline the job offer.\""
                    ]
                }
            ]
        },
        {
            "name": "Adjusting the Sentence",
            "steps": [
                {
                    "step": "3",
                    "title": "Rewrite the sentence.",
                    "subtitle": " Once you've added a determiner, you may need to tweak the sentence further. The verb may need to be tweaked slightly to become a noun and the sentence may need minor rearranging.",
                    "sub-points": [
                        "For example, \"The film impacted the students,\" can be changed to, \"The film had an impact on the students.\"",
                        "For instance, “The athlete prepared to run,” can be changed to, “The athlete prepared for a run.”"
                    ]
                },
                {
                    "step": "3",
                    "title": "Rewrite the sentence.",
                    "subtitle": " Once you've added a determiner, you may need to tweak the sentence further. The verb may need to be tweaked slightly to become a noun and the sentence may need minor rearranging.",
                    "sub-points": [
                        "For example, \"The film impacted the students,\" can be changed to, \"The film had an impact on the students.\"",
                        "For instance, “The athlete prepared to run,” can be changed to, “The athlete prepared for a run.”"
                    ]
                }
            ]
        },
        {
            "name": "Avoiding Common Mistakes",
            "steps": [
                {
                    "step": "3",
                    "title": "Use conversions only if it better conveys your tone.",
                    "subtitle": " Using nouns as verbs can be helpful if you're trying to sound less emotional and more objective. If dealing with sensitive information, for example, it can be beneficial to sound a little technical. Be aware of when you're using conversions and whether they convey the proper tone.",
                    "sub-points": [
                        "For example, take the sentence, \"He retaliated by filing a lawsuit.\" As this is a sensitive situation, you may want to phrase it in gentler terms. You can use the noun form to write the more played down sentence, \"The lawsuit may have been a form of retaliation.\""
                    ]
                }
            ]
        }
    ]
}