{
    "link": "https://www.wikihow.com/Do-Shadow-Work",
    "article": "How to Do Shadow Work",
    "intro": "Do you ever ask yourself, “Why did I do that?” or “Why did I say that?” Chances are, if you’ve done something out of character, it’s because of your Shadow. Psychologists and spiritual healers use the practice of shadow work in relation to Carl Jung’s personality theory to help others face their “dark” side—so, is this something you can do yourself? Absolutely! In this beginner’s guide, we’ll teach you everything there is to know about shadow work. Take a deep breath, and get ready to heal the deepest parts of your soul. ",
    "points": [
        {
            "name": "What is the Shadow?",
            "steps": [
                {
                    "step": "None",
                    "title": "The Shadow is the part(s) of yourself you don’t want to claim.",
                    "subtitle": " In the 1900s, the psychologist Carl Jung divided the personality into 4 archetypes: Persona, Anima/Animus, Shadow, and Self. With his theories, the Shadow soon became a popular representation of the lesser, repressed sides of the soul. The Shadow comprises the personality traits and thoughts you wish you didn’t have—your “darker” side. Think of the Shadow as anything that is holding you back in life (trauma, perceptions, insecurities, etc.).",
                    "sub-points": [
                        "Not all traits and feelings of the Shadow are considered negative, as every individual will have a different view on what is negative.",
                        "For instance, celibacy may be pushed into the Shadow if an individual suppresses sexual desires because of an unwanted emotion or feeling. This doesn’t necessarily mean celibacy is “bad,” but it suggests that the individual has a negative reaction toward sexual intimacy."
                    ]
                },
                {
                    "step": "None",
                    "title": "The Shadow is the part(s) of yourself you don’t want to claim.",
                    "subtitle": " In the 1900s, the psychologist Carl Jung divided the personality into 4 archetypes: Persona, Anima/Animus, Shadow, and Self. With his theories, the Shadow soon became a popular representation of the lesser, repressed sides of the soul. The Shadow comprises the personality traits and thoughts you wish you didn’t have—your “darker” side. Think of the Shadow as anything that is holding you back in life (trauma, perceptions, insecurities, etc.).",
                    "sub-points": [
                        "Not all traits and feelings of the Shadow are considered negative, as every individual will have a different view on what is negative.",
                        "For instance, celibacy may be pushed into the Shadow if an individual suppresses sexual desires because of an unwanted emotion or feeling. This doesn’t necessarily mean celibacy is “bad,” but it suggests that the individual has a negative reaction toward sexual intimacy."
                    ]
                }
            ]
        },
        {
            "name": "How the Shadow Affects You",
            "steps": [
                {
                    "step": "3",
                    "title": "The Shadow could instigate you to play the victim.",
                    "subtitle": " To avoid being exposed to something unpleasant and showcasing a part of yourself you’d rather suppress, your Shadow may cause you to act as a victim. This unconscious strategy keeps responsibility and blame away from you and towards others.",
                    "sub-points": [
                        "For instance, if someone starts a verbal fight that later escalates into something physical, they may say they had no part in it even if they were the initial instigator."
                    ]
                }
            ]
        },
        {
            "name": "What is shadow work?",
            "steps": [
                {
                    "step": "None",
                    "title": "The goal of shadow work is to accept the darker parts of yourself.",
                    "subtitle": " Shadow work is the act of uncovering, acknowledging, and understanding the parts of yourself you instinctively want to suppress. Rather than acting on them unconsciously, you take notice of your Shadow and consciously integrate it into your whole self. This doesn’t happen overnight, and many psychologists suggest that shadow work is never completed or finished. It’s an ongoing practice meant to help you be more self-aware and conscious of your decisions and the world around you.",
                    "sub-points": [
                        "Shadow work gives you the chance to understand yourself better by facing the parts of yourself you’d rather ignore or disclaim."
                    ]
                }
            ]
        },
        {
            "name": "How to Practice Shadow Work",
            "steps": [
                {
                    "step": "7",
                    "title": "Visit a therapist who’s trained in shadow work.",
                    "subtitle": " Some therapists and psychologists are specifically trained to guide patients through shadow work. They may use a meditative state to help you uncover the deepest parts of your Shadow, asking questions to access repressed memories and analyze projections.",
                    "sub-points": [
                        "If you’re seeking professional help with shadow work, make sure to ask the therapist if they’re trained in shadow work before scheduling an appointment."
                    ]
                }
            ]
        },
        {
            "name": "Shadow Work Exercises",
            "steps": [
                {
                    "step": "3",
                    "title": "Analyze what you’re avoiding.",
                    "subtitle": " In your journal or on a piece of paper, answer the question “What am I avoiding?” Write as much or as little as you want—just make sure not to restrict yourself. By answering this simple question, you’re acknowledging what you want to achieve from your shadow work.",
                    "sub-points": [
                        "For instance, if you answer, “I’m avoiding a relationship,” sit back and consider why you might be doing this. Perhaps you’re hurting from a recent breakup or are afraid of commitment."
                    ]
                }
            ]
        },
        {
            "name": "Benefits of Shadow Work",
            "steps": []
        },
        {
            "name": "What Is Shadow Work?",
            "steps": []
        }
    ]
}