{
    "link": "https://www.wikihow.com/Fix-an-Ignition-Key-That-Doesn%27t-Turn",
    "article": "How to Fix an Ignition Key That Doesn't Turn",
    "intro": "If you slide the key into your ignition but can’t turn it, you may be scratching your head trying to figure out what’s going on. While there are a bunch of different potential causes here, the good news is that most of the solutions are really easy to test and you should be on the road in no time. Read on to learn how to troubleshoot your ignition issues so that you can get your vehicle started.",
    "points": [
        {
            "name": "Quick Fixes",
            "steps": [
                {
                    "step": "5",
                    "title": "Get a new key cut if the pins are totally worn out.",
                    "subtitle": " If the key is too damaged to work, go to a dealership for your vehicle’s brand. Explain that the pins or worn down or the key is damaged—they’ll be able to cut you a new one.",
                    "sub-points": [
                        "Take the title with you, just in case you need to prove the vehicle is actually yours.",
                        "The cost of a new key will depend on how fancy the electronics are. A basic key with no electrical component will only be about $50, but laser-cut fobs with built-in transponders can be up to $300."
                    ]
                },
                {
                    "step": "5",
                    "title": "Get a new key cut if the pins are totally worn out.",
                    "subtitle": " If the key is too damaged to work, go to a dealership for your vehicle’s brand. Explain that the pins or worn down or the key is damaged—they’ll be able to cut you a new one.",
                    "sub-points": [
                        "Take the title with you, just in case you need to prove the vehicle is actually yours.",
                        "The cost of a new key will depend on how fancy the electronics are. A basic key with no electrical component will only be about $50, but laser-cut fobs with built-in transponders can be up to $300."
                    ]
                }
            ]
        },
        {
            "name": "Troubleshooting Other Problems",
            "steps": [
                {
                    "step": "3",
                    "title": "Move the steering wheel to unlock it while turning the key.",
                    "subtitle": " If you were applying any pressure to the steering wheel when you turned the car off, it may have locked the wheel in place with the steering pin. Try to turn the wheel. If it will not move, or moves only very slightly, it is likely locked. Move your steering wheel back and forth while turning the key to unlock it.",
                    "sub-points": [
                        "When you move the wheel back and forth, you will feel it stop abruptly as it comes into contact with the steering wheel lock.",
                        "If your wheel was turned slightly without you applying any pressure when you turned the car off, it still may engage the steering wheel lock."
                    ]
                },
                {
                    "step": "3",
                    "title": "Move the steering wheel to unlock it while turning the key.",
                    "subtitle": " If you were applying any pressure to the steering wheel when you turned the car off, it may have locked the wheel in place with the steering pin. Try to turn the wheel. If it will not move, or moves only very slightly, it is likely locked. Move your steering wheel back and forth while turning the key to unlock it.",
                    "sub-points": [
                        "When you move the wheel back and forth, you will feel it stop abruptly as it comes into contact with the steering wheel lock.",
                        "If your wheel was turned slightly without you applying any pressure when you turned the car off, it still may engage the steering wheel lock."
                    ]
                }
            ]
        },
        {
            "name": "Dealing with Ignition Cylinder Issues",
            "steps": [
                {
                    "step": "3",
                    "title": "Get the ignition cylinder replaced if nothing else works.",
                    "subtitle": " If all else fails, go to a mechanic and ask them to replace your ignition cylinder. Get your vehicle towed to a nearby repair facility or dealership. Explain the issue and ask them to swap out the ignition cylinder and take a look.",
                    "sub-points": [
                        "A new ignition cylinder will probably require a new key, just FYI."
                    ]
                }
            ]
        }
    ]
}