{
    "link": "https://www.wikihow.com/Make-Rosemary-Water-for-Hair",
    "article": "How to Make and Use Rosemary Water in Your Hair",
    "intro": "Hoping to give your scalp an all-natural boost? Look no further than rosemary! It’s well-known for its anti-fungal and anti-inflammatory properties (which can reduce dandruff and increase shine), but recently, rosemary has also shown great promise in promoting hair growth.",
    "points": [
        {
            "name": "Making Rosemary Water",
            "steps": [
                {
                    "step": "3",
                    "title": "Cool and strain the rosemary water into a .",
                    "subtitle": " Take the pot off the heat and let it cool completely for about 30 minutes. Then, strain the rosemary water into a spray bottle and throw out or compost the leftover rosemary. Your rosemary water is ready to use!",
                    "sub-points": [
                        "Alternatively, store the rosemary water in a  in the fridge for up to a week, until you’re ready to use it."
                    ]
                }
            ]
        },
        {
            "name": "Using Rosemary Water in Your Hair",
            "steps": [
                {
                    "step": "3",
                    "title": "Use your rosemary water 2-4 times a week.",
                    "subtitle": " For best results, apply your rosemary water to your scalp at least twice a week. If you like, use it every day to give your scalp plenty of contact with the beneficial compounds in the rosemary. Whatever your schedule, stay consistent! Hair growth is a long process, even when using remedies like rosemary oil—expect results in about 6 months.",
                    "sub-points": [
                        "To possibly enhance your results,  alongside your rosemary water. Rosemary oil may have a greater concentration of rosemary, and may help moisturize your hair, improving your scalp’s health."
                    ]
                }
            ]
        },
        {
            "name": "Benefits of Rosemary Oil for Hair",
            "steps": [
                {
                    "step": "3",
                    "title": "Rosemary oil may make your hair shinier.",
                    "subtitle": " Rosemary is known to have antioxidant and antimicrobial properties. When applied to your hair, it may wash away unwanted microbes and provide valuable antioxidants, which in turn may help your hair look shinier and feel healthier.",
                    "sub-points": [
                        "Also, rosemary may have anti-stress properties, which in turn may help to limit premature graying of hair."
                    ]
                }
            ]
        }
    ]
}