{
    "link": "https://www.wikihow.com/Parallel-Park",
    "article": "How to Parallel Park: Tips & Tricks for Smooth Parking",
    "intro": "You’re circling the block, looking for parking spots, but all you can find is parallel parking on the street. No biggie: you’ve got this. But if you’re still feeling a bit nervous about parallel parking, you’re not alone—many drivers, new and experienced alike, get a little bit flustered when it comes time to parallel park. That’s where we can help! Whether you’re getting ready to take your driver’s test or you just need a refresher, read through our article to get better at parallel parking and nab those in-demand parking spots.",
    "points": [
        {
            "name": "Find a parking space a little bit longer than your car.",
            "steps": [
                {
                    "step": "None",
                    "title": "Look for a space that gives you enough room to back into.",
                    "subtitle": " Once you get better at parallel parking, you may be able to park in tighter spaces, but you may want to start with spaces that have 6 feet (2 meters) of extra space. The space needs to be at least 3 feet (1 meter) longer than your vehicle.",
                    "sub-points": [
                        "If you've never parallel parked before, consider bringing plastic bins or cones to a parking lot and practice parallel parking between them.",
                        "Always make sure it’s safe and legal to park in a spot beforehand. Note any time limits or pay-for-parking signs so you aren’t surprised later on."
                    ]
                },
                {
                    "step": "None",
                    "title": "Look for a space that gives you enough room to back into.",
                    "subtitle": " Once you get better at parallel parking, you may be able to park in tighter spaces, but you may want to start with spaces that have 6 feet (2 meters) of extra space. The space needs to be at least 3 feet (1 meter) longer than your vehicle.",
                    "sub-points": [
                        "If you've never parallel parked before, consider bringing plastic bins or cones to a parking lot and practice parallel parking between them.",
                        "Always make sure it’s safe and legal to park in a spot beforehand. Note any time limits or pay-for-parking signs so you aren’t surprised later on."
                    ]
                }
            ]
        },
        {
            "name": "Pull up next to the car in front.",
            "steps": [
                {
                    "step": "None",
                    "title": "Drive as close to the front car as possible to begin parking.",
                    "subtitle": " Brake gently, then  to indicate that you’re going to park. Pull your car up next to the front car, stopping when your rear bumper is aligned with their rear bumper. Give yourself about 2 ft (0.61 m) of space between your car and the car next to you.",
                    "sub-points": [
                        "In most cases, you’ll be parallel parking on the right side of the road, which is why you’ll use your right turn signal. If you’re parking on the left side of the road, use your left turn signal instead."
                    ]
                }
            ]
        },
        {
            "name": "Back up while turning your steering wheel to the right.",
            "steps": [
                {
                    "step": "None",
                    "title": "Shift into reverse, then turn your wheel as you start .",
                    "subtitle": " Make sure the street behind you is clear of traffic.  Look over your shoulder towards the space. Once the back of your seat is even with the back of the vehicle beside you, turn your steering wheel quickly and evenly towards the spot until your vehicle is at a 45-degree angle as it enters the spot.",
                    "sub-points": [
                        "Conceptually, envision pushing the steering wheel in the direction that you want the back of the car to go.",
                        "Avoid swinging the front of your vehicle into the space too early, as you may hit or scrape the vehicle in front of you."
                    ]
                },
                {
                    "step": "None",
                    "title": "Shift into reverse, then turn your wheel as you start .",
                    "subtitle": " Make sure the street behind you is clear of traffic.  Look over your shoulder towards the space. Once the back of your seat is even with the back of the vehicle beside you, turn your steering wheel quickly and evenly towards the spot until your vehicle is at a 45-degree angle as it enters the spot.",
                    "sub-points": [
                        "Conceptually, envision pushing the steering wheel in the direction that you want the back of the car to go.",
                        "Avoid swinging the front of your vehicle into the space too early, as you may hit or scrape the vehicle in front of you."
                    ]
                }
            ]
        },
        {
            "name": "Straighten the wheel once you’re most of the way in.",
            "steps": [
                {
                    "step": "None",
                    "title": "Turn your wheel once your rear tire is 18 in (46 cm) from the curb.",
                    "subtitle": " Turn the steering wheel back towards the road once the rear of your vehicle is mostly in the space, and still slowly moving backwards. Do this when your front bumper is next to the rear bumper of the vehicle in front. This final maneuver moves the vehicle into the space and straightens it out simultaneously.",
                    "sub-points": [
                        "Another good indicator to begin turning the wheel the other way is when the license plate on the vehicle in front of your space is centered in your windshield."
                    ]
                }
            ]
        },
        {
            "name": "Pull forward if you need to.",
            "steps": [
                {
                    "step": "None",
                    "title": "Center yourself in the space between the 2 cars.",
                    "subtitle": " Once you’re in the space, you’ll likely need to do some adjusting before you’re in the exact center. Either pull forward or scoot back so there’s roughly an even amount of room in front of you and behind you.",
                    "sub-points": [
                        "Remember, you’ll still be in reverse at this point. If you need to drive forward, switch to drive first.",
                        "Leave enough room in front of you and behind you so that the cars around you can pull out if needed."
                    ]
                },
                {
                    "step": "None",
                    "title": "Center yourself in the space between the 2 cars.",
                    "subtitle": " Once you’re in the space, you’ll likely need to do some adjusting before you’re in the exact center. Either pull forward or scoot back so there’s roughly an even amount of room in front of you and behind you.",
                    "sub-points": [
                        "Remember, you’ll still be in reverse at this point. If you need to drive forward, switch to drive first.",
                        "Leave enough room in front of you and behind you so that the cars around you can pull out if needed."
                    ]
                }
            ]
        },
        {
            "name": "Start over if anything goes wrong.",
            "steps": [
                {
                    "step": "None",
                    "title": "Drive out of the spot and back in again if you need to.",
                    "subtitle": " When you’re new to parallel parking, you might have to try the spot a couple of times, and that’s okay! Put your turn signal on, make sure there’s no one in the road behind you, and pull up next to the front vehicle again.",
                    "sub-points": [
                        "Use your rear view mirror and your side mirror as well as turning in your seat to triple check that no cars are coming before you pull out again."
                    ]
                }
            ]
        }
    ]
}