{
    "link": "https://www.wikihow.com/Have-a-Glow-Up",
    "article": "How to Have a Glow Up",
    "intro": "Having a glow up is an empowering transformation of who you are. This might look like changing your appearance, drinking more water, or achieving your goals. Whatever your glow up means to you, it’s all about becoming the ",
    "points": [
        {
            "name": "Changing Your Appearance",
            "steps": [
                {
                    "step": "5",
                    "title": " that you have always wanted to try.",
                    "subtitle": " Maybe it’s bangs, balayage, or a bob? Take the plunge and get that cut or color you have always wanted! Look online for inspiration if you need it and print out pictures to take along with you to your hair appointment. Explain to your hairstylist the look you’re going for and listen to their advice about what cut and color would work best with your style.",
                    "sub-points": [
                        "A new hairstyle is an easy way to quickly change your appearance dramatically!"
                    ]
                }
            ]
        },
        {
            "name": "Making Lifestyle Changes",
            "steps": [
                {
                    "step": "4",
                    "title": " to keep yourself healthy.",
                    "subtitle": " Exercise helps you to look and feel your best, in both your body and mind! Find a type of exercise that you enjoy, such as swimming, , or . Aim to exercise 3-5 times per week, unless you have been instructed otherwise by a health professional. You can also exercise with friends if that makes it more fun!",
                    "sub-points": [
                        "You don’t have to join a gym unless you want to. There are plenty of ways to exercise in your own home."
                    ]
                }
            ]
        },
        {
            "name": "Becoming Confident and Setting Goals",
            "steps": [
                {
                    "step": "4",
                    "title": " and challenge yourself to accomplish them.",
                    "subtitle": " Maybe you have financial, career, or personal goals that you have been wanting to achieve? Sit down and write a list of your goals. Then break each goal up into smaller, actionable steps that you can get started on. Keep your goals realistic and celebrate your successes!",
                    "sub-points": [
                        "Remember that your goals can be as big or as little as you like. As long as you are realistic about how you will achieve them, that’s all that matters!"
                    ]
                }
            ]
        }
    ]
}