{
    "link": "https://www.wikihow.com/Use-Nespresso",
    "article": "How to Work and Clean Your Nespresso Machine",
    "intro": "After drooling over the delicious espressos and intricate coffee concoctions a Nespresso can make, you finally bought yourself a machine. When it arrives at your door, you might realize that you’re not entirely sure how to work your Nespresso to make these incredible drinks. Luckily, using a Nespresso is super easy! Whether you’re new to this espresso machine or are dusting it off after a period of disuse, we’ll give you step-by-step instructions on how to use your Nespresso. Cleaning and caring for your machine is super important, so we’ll tell you how to descale your Nespresso too. Read on to get brewing!",
    "points": [
        {
            "name": "Making Coffee with Nespresso",
            "steps": [
                {
                    "step": "9",
                    "title": "Re-order pods before you run out.",
                    "subtitle": " Now that you know the joys of brewing your espresso drinks in your own home, make sure you always have another pod on hand for your next brew. Keep your pods in a clear container so you know how many you have left. When you start to run low, order new coffee pods. This way, you’ll always have a seamless stream of coffee.",
                    "sub-points": [
                        "Shop online to save time and keep your favorite flavors in your cart. Nespresso sells their own , while other popular coffee makers like Starbucks, Peet’s Coffee, and Lavazza sell Nespresso-compatible pods.",
                        "Buy your pods in bulk so you always have another espresso ready to go. Most espresso packages come in packs of 10 to up to 100."
                    ]
                },
                {
                    "step": "9",
                    "title": "Re-order pods before you run out.",
                    "subtitle": " Now that you know the joys of brewing your espresso drinks in your own home, make sure you always have another pod on hand for your next brew. Keep your pods in a clear container so you know how many you have left. When you start to run low, order new coffee pods. This way, you’ll always have a seamless stream of coffee.",
                    "sub-points": [
                        "Shop online to save time and keep your favorite flavors in your cart. Nespresso sells their own , while other popular coffee makers like Starbucks, Peet’s Coffee, and Lavazza sell Nespresso-compatible pods.",
                        "Buy your pods in bulk so you always have another espresso ready to go. Most espresso packages come in packs of 10 to up to 100."
                    ]
                }
            ]
        },
        {
            "name": "Descaling Your Machine",
            "steps": [
                {
                    "step": "10",
                    "title": "Exit descaling mode by pressing the same buttons that started it.",
                    "subtitle": " Now that your machine is fully cleaned out, it needs to get back into brew mode. Just press the same buttons that started the descaling process to exit it. For example, with the Pixie, press and hold the small and large coffee buttons for 3 seconds. Then, let your machine rest for about 10 minutes before brewing a cup of espresso.",
                    "sub-points": [
                        "The outside of your machine also needs care, so wipe it down with a damp cloth to remove any water or dust."
                    ]
                }
            ]
        }
    ]
}