{
    "link": "https://www.wikihow.com/Get-Rid-of-Ladybugs",
    "article": "How to Remove Ladybugs from Your Home and Yard",
    "intro": "Ladybugs might be beneficial in your garden, but they’re not so fun to deal with when they’re infesting your home or yard. Fortunately, there are easy ways to get rid of them. In this article, we’ll tell you how to trap, kill, and prevent ladybugs from getting into your house with a few simple home remedies. If these bugs are infesting your yard, we’ll also show you how to get rid of them outside. Read on to learn how to get rid of ladybugs!",
    "points": [
        {
            "name": "Removing Ladybugs in the House",
            "steps": []
        },
        {
            "name": "Preventing Ladybugs from Getting Inside",
            "steps": []
        },
        {
            "name": "Getting Rid of Ladybugs Outside",
            "steps": [
                {
                    "step": "3",
                    "title": "Use an  if the infestation is difficult to control.",
                    "subtitle": " Find an outdoor insecticide at your local gardening center and check the label to make sure it’s safe for pets, children, and plants. Then, read and follow the manufacturer’s directions to apply it. Always wear gloves, a face mask, and goggles when spraying an outdoor insecticide.",
                    "sub-points": [
                        "Most outdoor insecticides are dusts, powders, or sprays.",
                        "Instead of directly killing the ladybugs,  in your yard. They are a food source for ladybugs, so getting rid of them might cause the ladybugs to leave your garden."
                    ]
                },
                {
                    "step": "3",
                    "title": "Use an  if the infestation is difficult to control.",
                    "subtitle": " Find an outdoor insecticide at your local gardening center and check the label to make sure it’s safe for pets, children, and plants. Then, read and follow the manufacturer’s directions to apply it. Always wear gloves, a face mask, and goggles when spraying an outdoor insecticide.",
                    "sub-points": [
                        "Most outdoor insecticides are dusts, powders, or sprays.",
                        "Instead of directly killing the ladybugs,  in your yard. They are a food source for ladybugs, so getting rid of them might cause the ladybugs to leave your garden."
                    ]
                }
            ]
        }
    ]
}