{
    "link": "https://www.wikihow.com/Grow-Truffles",
    "article": "How to Grow Truffles",
    "intro": "Truffles are considered a delicacy and they are incredibly flavorful. They are also more difficult to cultivate than other edible fungi. Growing truffles can be a lucrative agricultural venture for this reason. It will take at least a few years before you can start harvesting truffles, so get started now to grow your own truffles.",
    "points": [
        {
            "name": "Planning Your Truffle Farm",
            "steps": [
                {
                    "step": "5",
                    "title": "Put up a good fence around the area to keep out intruders.",
                    "subtitle": " Truffles are coveted by animals and humans for their flavor. Humans may also try to steal truffles because of the high price that they can fetch. To protect the fruits of your labor, consider putting a high fence around the area where you will be growing the truffles.",
                    "sub-points": [
                        "For added protection, you might even consider putting up barbed wire or installing an electric fence."
                    ]
                }
            ]
        },
        {
            "name": "Planting the Trees",
            "steps": [
                {
                    "step": "4",
                    "title": "Weed with a hoe during the first couple of years.",
                    "subtitle": " Weeds and other types of plants will pull valuable nutrients away from the truffles, so it is important to remove them when you spot them. However, mowing in the first 2 years is not recommended. Instead, use a hoe to dig up any weeds or other plants that spring up near the base of the trees.",
                    "sub-points": [
                        "Do not use weed killer or other toxic chemicals on the trees or surrounding areas as they may seep into the ground and poison your truffles."
                    ]
                }
            ]
        },
        {
            "name": "Harvesting the Truffles",
            "steps": [
                {
                    "step": "4",
                    "title": "Consider training a dog to .",
                    "subtitle": " A well-trained dog can make harvesting truffles much easier for you. You can train the dog to find, dig up, and bring you the truffles. Use positive reinforcement to teach your dog to find truffles and bring them to you. For example, every time your dog retrieves a truffle, make sure to offer lots of praise and a treat.",
                    "sub-points": [
                        "You can also use a female pig to find truffles for you, but you have to watch the pig closely when they find a truffle because they will eat it."
                    ]
                }
            ]
        }
    ]
}