{
    "link": "https://www.wikihow.com/Get-Rid-of-Fruit-Flies-in-Plants",
    "article": "How to Get Rid of Fruit Flies in Plants: 9 Expert Tips",
    "intro": "Have you noticed small, annoying flies on or around your houseplants? While they could be fruit flies, it’s just as likely that they’re fungus gnats living in the soil. Fortunately, getting rid of the flies (no matter what they are) is simple with prevention methods and natural remedies. In this article, we’ll share everything you need to know about getting rid of flies and gnats to keep your houseplants fresh and fly-free. ",
    "points": [
        {
            "name": "Make a vinegar trap.",
            "steps": [
                {
                    "step": "None",
                    "title": "Vinegar attracts and then drowns fruit flies quickly.",
                    "subtitle": " If you are dealing with fruit flies and not gnats, a vinegar trap is an effective way to get rid of them quickly. Pour about 1 in (2.5 cm) of apple cider vinegar into a jar, then poke 3 to 4 small holes in the lid before screwing it on. Place the trap near your plant or on top of the soil, then wait a couple of days.",
                    "sub-points": [
                        "The fruit flies will crawl into the holes in the lid, but they won’t be able to fly back out. Eventually, they’ll die inside the jar.",
                        "To make your trap even more effective, add a few drops of dish soap to the vinegar. Dish soap will make the vinegar stickier, so the flies will get stuck in the liquid and drown.",
                        "This trap isn’t as effective against fungus gnats, but it works really well against fruit flies."
                    ]
                },
                {
                    "step": "None",
                    "title": "Vinegar attracts and then drowns fruit flies quickly.",
                    "subtitle": " If you are dealing with fruit flies and not gnats, a vinegar trap is an effective way to get rid of them quickly. Pour about 1 in (2.5 cm) of apple cider vinegar into a jar, then poke 3 to 4 small holes in the lid before screwing it on. Place the trap near your plant or on top of the soil, then wait a couple of days.",
                    "sub-points": [
                        "The fruit flies will crawl into the holes in the lid, but they won’t be able to fly back out. Eventually, they’ll die inside the jar.",
                        "To make your trap even more effective, add a few drops of dish soap to the vinegar. Dish soap will make the vinegar stickier, so the flies will get stuck in the liquid and drown.",
                        "This trap isn’t as effective against fungus gnats, but it works really well against fruit flies."
                    ]
                },
                {
                    "step": "None",
                    "title": "Vinegar attracts and then drowns fruit flies quickly.",
                    "subtitle": " If you are dealing with fruit flies and not gnats, a vinegar trap is an effective way to get rid of them quickly. Pour about 1 in (2.5 cm) of apple cider vinegar into a jar, then poke 3 to 4 small holes in the lid before screwing it on. Place the trap near your plant or on top of the soil, then wait a couple of days.",
                    "sub-points": [
                        "The fruit flies will crawl into the holes in the lid, but they won’t be able to fly back out. Eventually, they’ll die inside the jar.",
                        "To make your trap even more effective, add a few drops of dish soap to the vinegar. Dish soap will make the vinegar stickier, so the flies will get stuck in the liquid and drown.",
                        "This trap isn’t as effective against fungus gnats, but it works really well against fruit flies."
                    ]
                }
            ]
        },
        {
            "name": "Let the soil dry out before watering again.",
            "steps": [
                {
                    "step": "None",
                    "title": "Moisture attracts fruit flies and fungus gnats, so don’t overdo it.",
                    "subtitle": " Most experts recommend waiting until the top 1 to 3 in (2.5 to 7.6 cm) of soil dries out before watering again.",
                    "sub-points": [
                        "You can quickly test your soil by sticking a finger into it. If your finger comes out slightly wet with dirt on it, your soil is still moist, and you don’t need to water. If your finger comes out mostly clean and dry, then it’s time to water your plant."
                    ]
                }
            ]
        },
        {
            "name": "Point a fan at your plants.",
            "steps": [
                {
                    "step": "None",
                    "title": "Use a fan to dry out the soil and prevent flies.",
                    "subtitle": " Fruit flies and fungus gnats are attracted to damp, moist soil. The more you can let your soil dry out, the better. After you water your plants, keep a fan turned on and pointed down at the soil to quickly remove any excess moisture.",
                    "sub-points": [
                        "Be sure to empty out the drainage dish beneath your pot, too. Standing water can attract more flies and gnats."
                    ]
                }
            ]
        },
        {
            "name": "Cover the soil with sand or gravel.",
            "steps": [
                {
                    "step": "None",
                    "title": "A thin layer on top of the soil dries it out to prevent flies and gnats.",
                    "subtitle": " Plus,  and  aren’t great places to lay eggs, so flies may look elsewhere. Sprinkle about  in (1.3 cm) of sand or gravel on top of the potting soil, then spread it around evenly.",
                    "sub-points": [
                        "Adding gravel and sand won’t affect how you water or care for your plant. When you water your plant, the water will run right through the top layer and into the soil."
                    ]
                }
            ]
        },
        {
            "name": "Repot the plant in well-draining soil.",
            "steps": [
                {
                    "step": "None",
                    "title": "Soil that doesn’t drain well may be holding onto moisture.",
                    "subtitle": " If you’ve noticed that water tends to pool on top of your soil, it may be time to repot your plant. Choose a  that contains sand, silt, or loam to ensure that water runs out quickly, then .",
                    "sub-points": [
                        "Sensitive plants may go into a slight shock after being replanted. However, most bounce back after a couple of days and a good watering."
                    ]
                }
            ]
        },
        {
            "name": "Use yellow sticky traps.",
            "steps": [
                {
                    "step": "None",
                    "title": " catch fruit flies and gnats without chemical intervention.",
                    "subtitle": " Most sticky traps even come with a wooden stake so you can easily submerge them in your potting soil right next to the plant. Keep an eye on the sticky traps, and change them out whenever they get full of bugs.",
                    "sub-points": [
                        "Sticky traps only catch adult fruit flies and gnats; they won’t be able to get the larvae or eggs inside of the soil. However, they’re very effective at stopping the spread of fruit flies in your home."
                    ]
                }
            ]
        },
        {
            "name": "Mix diatomaceous earth into the soil.",
            "steps": [
                {
                    "step": "None",
                    "title": " dries out the soil and may kill fungus gnats.",
                    "subtitle": " While more research is needed to know if this method works well, experts note that it won’t harm your plants to try. Sprinkle 1 to 2 in (2.5 to 5.1 cm) of diatomaceous earth onto the soil, then work it into your potting soil with your hands.",
                    "sub-points": [
                        "Diatomaceous earth is harmful for insects, but it won’t hurt your plants or any other animals in your home."
                    ]
                }
            ]
        },
        {
            "name": "Try a microbial insecticide.",
            "steps": [
                {
                    "step": "None",
                    "title": "Target the larvae in the soil with a microbial insecticide.",
                    "subtitle": "  contain Bacillus thuringiensis subsp. israelensis (Bti), a naturally occuring bacteria that is less toxic than typical insecticides or pesticides. Use an insecticide that contains Bti in your soil, and reapply it every 5 to 7 days until the flies and gnats are gone.",
                    "sub-points": [
                        "Microbial insecticides only target the pests at the larvae stage, so they won’t kill any adult or pupae gnats and flies."
                    ]
                }
            ]
        },
        {
            "name": "Use chemical insecticides on severe infestations.",
            "steps": [
                {
                    "step": "None",
                    "title": " are strong, but they’re also fairly toxic.",
                    "subtitle": " If you’ve tried multiple methods and nothing has worked, pick up an insecticide that’s safe to use for indoor plants. Spray the soil and the roots of your plant to kill flies and gnats right away. Always follow the instructions on the bottle, and keep children and pets away from the area.",
                    "sub-points": [
                        "Chemical treatments are most effective when paired with other prevention methods. If you choose to use chemical insecticides, make sure you’re still letting your soil dry out and using well-draining potting soil to avoid fruit flies and fungus gnats all together.",
                        "Chemical treatments are most effective when paired with other prevention methods. If you choose to use chemical insecticides, make sure you’re still letting your soil dry out and using well-draining potting soil to avoid fruit flies and fungus gnats all together."
                    ]
                }
            ]
        },
        {
            "name": "How Do You Catch Fruit Flies?",
            "steps": [
                {
                    "step": "None",
                    "title": " are strong, but they’re also fairly toxic.",
                    "subtitle": " If you’ve tried multiple methods and nothing has worked, pick up an insecticide that’s safe to use for indoor plants. Spray the soil and the roots of your plant to kill flies and gnats right away. Always follow the instructions on the bottle, and keep children and pets away from the area.",
                    "sub-points": [
                        "Chemical treatments are most effective when paired with other prevention methods. If you choose to use chemical insecticides, make sure you’re still letting your soil dry out and using well-draining potting soil to avoid fruit flies and fungus gnats all together.",
                        "Chemical treatments are most effective when paired with other prevention methods. If you choose to use chemical insecticides, make sure you’re still letting your soil dry out and using well-draining potting soil to avoid fruit flies and fungus gnats all together."
                    ]
                }
            ]
        }
    ]
}