{
    "link": "https://www.wikihow.com/Deal-with-a-Cheating-Husband-Spiritually",
    "article": "How to Deal with a Cheating Husband Spiritually",
    "intro": "If you recently found out that your husband has been unfaithful, you're probably struggling with a lot of intense emotions, from anger and grief to confusion about what to do next. While there are no easy answers for how to move forward, it's often easier to cope if can lean on your faith in God during this tough time. Reach out to some of the supportive people in your life, too—you shouldn't have to go through this alone. We'll be here to help along the way, as well.",
    "points": [
        {
            "name": "Let yourself feel whatever emotions come up.",
            "steps": [
                {
                    "step": "None",
                    "title": "Give yourself time to process what you're feeling.",
                    "subtitle": " Relying on God doesn't mean you have to be strong all the time, so don't feel like you have to bury your emotions. If you're sad, let yourself cry. If you're mad, give yourself permission to feel that anger. God may have a lesson for you hidden somewhere in that pain, so ask Him to help you learn from this experience and ultimately become closer to Him.",
                    "sub-points": [
                        "For instance, if you're struggling with feelings of anger, God may be giving you a chance to lean on Him for peace.",
                        "If you feel like crying on a friend's shoulder, God might be showing you the people in your life who are there to support and care for you."
                    ]
                },
                {
                    "step": "None",
                    "title": "Give yourself time to process what you're feeling.",
                    "subtitle": " Relying on God doesn't mean you have to be strong all the time, so don't feel like you have to bury your emotions. If you're sad, let yourself cry. If you're mad, give yourself permission to feel that anger. God may have a lesson for you hidden somewhere in that pain, so ask Him to help you learn from this experience and ultimately become closer to Him.",
                    "sub-points": [
                        "For instance, if you're struggling with feelings of anger, God may be giving you a chance to lean on Him for peace.",
                        "If you feel like crying on a friend's shoulder, God might be showing you the people in your life who are there to support and care for you."
                    ]
                }
            ]
        },
        {
            "name": "Turn to God for comfort.",
            "steps": [
                {
                    "step": "None",
                    "title": "Ask Him to give you strength and grace.",
                    "subtitle": " Finding out that you've been cheated on can feel like your whole world was turned upside-down. You might not be sure whether you want to stay with your husband or divorce him, and you might not even be fully sure what you're feeling. Although it feels difficult, try to turn to God during this time—let His peace guide you as you move forward.",
                    "sub-points": [
                        "Sometimes when you're going through a really difficult time, it can be hard to feel connected to God. Even if your faith doesn't feel strong, pray that God will guide you in what to do next.",
                        "Psalm 46:1 describes how God helps His people in times of need: \"God is our refuge and strength, an ever-present help in trouble.\""
                    ]
                },
                {
                    "step": "None",
                    "title": "Ask Him to give you strength and grace.",
                    "subtitle": " Finding out that you've been cheated on can feel like your whole world was turned upside-down. You might not be sure whether you want to stay with your husband or divorce him, and you might not even be fully sure what you're feeling. Although it feels difficult, try to turn to God during this time—let His peace guide you as you move forward.",
                    "sub-points": [
                        "Sometimes when you're going through a really difficult time, it can be hard to feel connected to God. Even if your faith doesn't feel strong, pray that God will guide you in what to do next.",
                        "Psalm 46:1 describes how God helps His people in times of need: \"God is our refuge and strength, an ever-present help in trouble.\""
                    ]
                }
            ]
        },
        {
            "name": "Ask your husband to explain what happened.",
            "steps": [
                {
                    "step": "None",
                    "title": "Just don't dig for unnecessary details that will be hurtful.",
                    "subtitle": " It can often be helpful to understand some of the basic facts of your partner's affair, like who it happened with, how long it lasted, and when it was. However, don't press your husband for graphic details—those images will live in your head and can make it harder to heal. Ask God to for the wisdom to know what information will be helpful as you move forward, and only ask the questions that will give you information that you really need to know.",
                    "sub-points": [
                        "For instance, you might say something like, \"I need to know how many other partners you've had since we've been together. Also, I'd like to know whether you practiced safe sex or if I should see my doctor to get tested for STIs.\"",
                        "Try to have this conversation as calmly as possible. If you're feeling really emotional, it might help to postpone it.",
                        "It may help to have a mediator present for this conversation, like a marriage counselor or an elder in your church."
                    ]
                },
                {
                    "step": "None",
                    "title": "Just don't dig for unnecessary details that will be hurtful.",
                    "subtitle": " It can often be helpful to understand some of the basic facts of your partner's affair, like who it happened with, how long it lasted, and when it was. However, don't press your husband for graphic details—those images will live in your head and can make it harder to heal. Ask God to for the wisdom to know what information will be helpful as you move forward, and only ask the questions that will give you information that you really need to know.",
                    "sub-points": [
                        "For instance, you might say something like, \"I need to know how many other partners you've had since we've been together. Also, I'd like to know whether you practiced safe sex or if I should see my doctor to get tested for STIs.\"",
                        "Try to have this conversation as calmly as possible. If you're feeling really emotional, it might help to postpone it.",
                        "It may help to have a mediator present for this conversation, like a marriage counselor or an elder in your church."
                    ]
                },
                {
                    "step": "None",
                    "title": "Just don't dig for unnecessary details that will be hurtful.",
                    "subtitle": " It can often be helpful to understand some of the basic facts of your partner's affair, like who it happened with, how long it lasted, and when it was. However, don't press your husband for graphic details—those images will live in your head and can make it harder to heal. Ask God to for the wisdom to know what information will be helpful as you move forward, and only ask the questions that will give you information that you really need to know.",
                    "sub-points": [
                        "For instance, you might say something like, \"I need to know how many other partners you've had since we've been together. Also, I'd like to know whether you practiced safe sex or if I should see my doctor to get tested for STIs.\"",
                        "Try to have this conversation as calmly as possible. If you're feeling really emotional, it might help to postpone it.",
                        "It may help to have a mediator present for this conversation, like a marriage counselor or an elder in your church."
                    ]
                }
            ]
        },
        {
            "name": "Talk to your husband about why he cheated.",
            "steps": [
                {
                    "step": "None",
                    "title": "There's no excuse, but it may help to understand why this happened.",
                    "subtitle": " There are a lot of reasons why people cheat on their spouses. While there might not be a clear cause-and-effect, you might find it easier to work through your feelings if you have some idea of where things went wrong.",
                    "sub-points": [
                        "For instance, you might say something like, \"Were you feeling dissatisfied in our marriage?\" or \"Did the other person offer you something that I didn't?\"",
                        "It may take some time for you and your husband to work through what led him to cheat. It can help a lot to work through these issues with a spiritual leader or a counselor."
                    ]
                },
                {
                    "step": "None",
                    "title": "There's no excuse, but it may help to understand why this happened.",
                    "subtitle": " There are a lot of reasons why people cheat on their spouses. While there might not be a clear cause-and-effect, you might find it easier to work through your feelings if you have some idea of where things went wrong.",
                    "sub-points": [
                        "For instance, you might say something like, \"Were you feeling dissatisfied in our marriage?\" or \"Did the other person offer you something that I didn't?\"",
                        "It may take some time for you and your husband to work through what led him to cheat. It can help a lot to work through these issues with a spiritual leader or a counselor."
                    ]
                }
            ]
        },
        {
            "name": "Don't blame yourself for what happened.",
            "steps": [
                {
                    "step": "None",
                    "title": "This isn't your fault.",
                    "subtitle": " Even if you made mistakes that contributed to your husband being unhappy in the relationship, your husband is still the one who made the decision to go outside of the marriage. It's important that he takes responsibility for his actions. If he doesn't, there's no guarantee that he won't be unfaithful again if he feels dissatisfied.",
                    "sub-points": [
                        "As you process what happened, you may find that you feel that you could have done things differently—like being more attentive or understanding toward your husband. You're still not to blame for him cheating, but you can take those things into consideration in the future."
                    ]
                }
            ]
        },
        {
            "name": "Talk to someone you trust about how you're feeling.",
            "steps": [
                {
                    "step": "None",
                    "title": "Express your emotions to your husband, too.",
                    "subtitle": " Don't feel like you have to hold it all in—you have every right to let your husband know how much he hurt you. However, he might be dealing with his own feelings of guilt or even defensiveness, so he might not be the most supportive listener. It's important that you find someone supportive to talk to—having someone to lean on can help you process what you're feeling and begin to heal.",
                    "sub-points": [
                        "Try turning to someone you really respect in your church. That way, you'll be able to get spiritual advice that's in line with your beliefs.",
                        "You might also look for a faith-based counselor as you move forward."
                    ]
                },
                {
                    "step": "None",
                    "title": "Express your emotions to your husband, too.",
                    "subtitle": " Don't feel like you have to hold it all in—you have every right to let your husband know how much he hurt you. However, he might be dealing with his own feelings of guilt or even defensiveness, so he might not be the most supportive listener. It's important that you find someone supportive to talk to—having someone to lean on can help you process what you're feeling and begin to heal.",
                    "sub-points": [
                        "Try turning to someone you really respect in your church. That way, you'll be able to get spiritual advice that's in line with your beliefs.",
                        "You might also look for a faith-based counselor as you move forward."
                    ]
                }
            ]
        },
        {
            "name": "Be patient with yourself.",
            "steps": [
                {
                    "step": "None",
                    "title": "Don't expect your hurt feelings to go away overnight.",
                    "subtitle": " Being cheated on can be a really traumatic experience. In fact, it can even lead to something known as post-infidelity stress disorder, which is very similar to PTSD. You might find it difficult to move on from your pain, and it can even start to affect how well you're able to function in other areas of your life. You may be able to overcome this by relying on your faith in God and leaning on your support group, but it can can take time—and that's okay.",
                    "sub-points": [
                        "Do your best to take care of your responsibilities every day, like going to work and taking care of your children—but don't be too hard on yourself if you're not quite up to your usual self.",
                        "Take time to heal, you can look into getting therapy."
                    ]
                },
                {
                    "step": "None",
                    "title": "Don't expect your hurt feelings to go away overnight.",
                    "subtitle": " Being cheated on can be a really traumatic experience. In fact, it can even lead to something known as post-infidelity stress disorder, which is very similar to PTSD. You might find it difficult to move on from your pain, and it can even start to affect how well you're able to function in other areas of your life. You may be able to overcome this by relying on your faith in God and leaning on your support group, but it can can take time—and that's okay.",
                    "sub-points": [
                        "Do your best to take care of your responsibilities every day, like going to work and taking care of your children—but don't be too hard on yourself if you're not quite up to your usual self.",
                        "Take time to heal, you can look into getting therapy."
                    ]
                }
            ]
        },
        {
            "name": "Write down your feelings.",
            "steps": [
                {
                    "step": "None",
                    "title": "A journal can help you through the healing process.",
                    "subtitle": " Writing about what you're going through can help you sort through the tangled thoughts and feelings that you may be experiencing. It's a private way to express yourself, so you can get it all out without fear of being judged by anyone.",
                    "sub-points": [
                        "You might also include Bible verses that you find helpful during this time. Then, when you're really struggling, read back through your journal and pray that God will give you comfort through those same verses."
                    ]
                }
            ]
        },
        {
            "name": "Pray for your husband.",
            "steps": [
                {
                    "step": "None",
                    "title": "This can be hard, but try to channel God's grace.",
                    "subtitle": " Obviously your husband lost his struggle with temptation, and even if you've never cheated on a partner before, you probably have your own temptations that you struggle with. Even if you're not ready to forgive your husband, pray that God will lead him away from sin. You might even find that one day, the whole story will be a testament to God's goodness and compassion.",
                    "sub-points": [
                        "Keep praying for your husband even if you decide to divorce him—after all,  Jesus instructed his followers in Luke 6:28: \"Pray for those who mistreat you.\""
                    ]
                }
            ]
        },
        {
            "name": "Take some time apart if you need it.",
            "steps": [
                {
                    "step": "None",
                    "title": "Try a separation if you need space to figure out what happens next.",
                    "subtitle": " It can take some time to work through your feelings, and you probably don't feel like you can trust your husband after what happened. For your own day-to-day peace, you might feel better if one of you temporarily moves out of your home. During this trial separation, have frequent conversations with your husband to find out if he feels remorseful, takes responsibility for his actions, and is dedicated to rebuilding the trust between the two of you.",
                    "sub-points": [
                        "Pay attention to his actions—not just his words. If he's really putting in the effort to prove to you that he wants to repair your relationship, like following through on all of his promises and being completely transparent with you, it may be a good sign for the future."
                    ]
                }
            ]
        },
        {
            "name": "Decide whether you want to stay together.",
            "steps": [
                {
                    "step": "None",
                    "title": "Give yourself all the time you need to make up your mind.",
                    "subtitle": " This isn't a decision that should be rushed, especially if you have children together. As you're deciding, think about what happened and why, as well as what you need emotionally in order to start rebuilding your marriage. Pray about the decision and talk to your loved ones, but in the end, go with your heart.",
                    "sub-points": [
                        "If you do decide to stay together, think about what you can do to help your relationship be stronger than it was before. Also, set clear boundaries about what is and isn't okay as you move forward.",
                        "If your husband is defensive or doesn't seem sorry for what happened, or you really don't feel you'll be able to trust him again, it may be best to end the marriage. In fact, adultery is described in the Bible as a legitimate reason for divorce."
                    ]
                },
                {
                    "step": "None",
                    "title": "Give yourself all the time you need to make up your mind.",
                    "subtitle": " This isn't a decision that should be rushed, especially if you have children together. As you're deciding, think about what happened and why, as well as what you need emotionally in order to start rebuilding your marriage. Pray about the decision and talk to your loved ones, but in the end, go with your heart.",
                    "sub-points": [
                        "If you do decide to stay together, think about what you can do to help your relationship be stronger than it was before. Also, set clear boundaries about what is and isn't okay as you move forward.",
                        "If your husband is defensive or doesn't seem sorry for what happened, or you really don't feel you'll be able to trust him again, it may be best to end the marriage. In fact, adultery is described in the Bible as a legitimate reason for divorce."
                    ]
                }
            ]
        },
        {
            "name": "Find a support group for victims of adultery.",
            "steps": [
                {
                    "step": "None",
                    "title": "It's really important to have people to talk to.",
                    "subtitle": " It can be especially helpful to talk to other people who've been through the same experience. Check to see if there are any support groups meeting in your area—your local community center might be a good place to start, or your church might even have a group meeting.",
                    "sub-points": [
                        "If there's nothing available nearby, you might check out an online support group like Infidelity Survivors Anonymous or Infidelity Recovery Institute."
                    ]
                }
            ]
        },
        {
            "name": "Work with a counselor to forgive your spouse.",
            "steps": [
                {
                    "step": "None",
                    "title": "Forgiveness is an important part of moving on.",
                    "subtitle": " In Luke 6:37, Jesus says, \"Forgive, and you will be forgiven.\" It's not easy, but it's important to eventually be able to look past your own pain and see your husband simply as a person who made a mistake. Remember that God forgives us all for our sins, and He expects us to forgive others as well. However, if you're having a hard time doing this on your own, it can help to work with a faith-based counselor to work through your emotions.",
                    "sub-points": [
                        "Forgiveness doesn't mean you necessarily have to trust your husband again—you might forgive him and still make the decision not to be together in the future."
                    ]
                }
            ]
        }
    ]
}