{
    "link": "https://www.wikihow.com/Get-a-Job-in-Australia",
    "article": "How to Get a Job in Australia",
    "intro": "With its strong job market, high standard of living and gorgeous environment, it’s no wonder that Australia is a prime target for job-seekers all over the globe. Applying for a job “Down Under” is an intense and exciting process, one that’ll be worth the effort when you finally nail down that Australian job.",
    "points": [
        {
            "name": "Getting a Typical Work Visa",
            "steps": [
                {
                    "step": "7",
                    "title": "Submit your visa application.",
                    "subtitle": " If you require a visa to work in Australia, this will be your first priority! Prospective employers will ask about your immigration status, and having your visa (or at least having started the application process) is a prerequisite for most job vacancies.",
                    "sub-points": [
                        "You can apply online at .",
                        "Remember, visa priority is given to people who have skills, qualifications and experience in shortage occupations, so dust off your resume and brag a little!"
                    ]
                },
                {
                    "step": "7",
                    "title": "Submit your visa application.",
                    "subtitle": " If you require a visa to work in Australia, this will be your first priority! Prospective employers will ask about your immigration status, and having your visa (or at least having started the application process) is a prerequisite for most job vacancies.",
                    "sub-points": [
                        "You can apply online at .",
                        "Remember, visa priority is given to people who have skills, qualifications and experience in shortage occupations, so dust off your resume and brag a little!"
                    ]
                }
            ]
        },
        {
            "name": "Exploring Other Visa Options",
            "steps": [
                {
                    "step": "3",
                    "title": "Look out for scams.",
                    "subtitle": "  Sad to say, but there are many visa con artists out there, so use caution when someone offers to help you get an Australian work visa. The Australian government keeps a list of common and current scams at .  For instance, don’t fall for scam phone calls demanding immediate payment for a visa renewal, and be very cautious regarding promises of an Australian visa and job (with an initial payment) on job websites. Use your common sense and stick to official Australian government sites; the URL will end with “.gov.au”!",
                    "sub-points": [
                        "It is illegal for third parties (employers, etc.) to financially gain from nominating or sponsoring someone for a visa.  In other words, a potential Australian employer cannot ask you to pay a fee ahead of time for sponsorship, or deduct from your paycheck after the fact. You might be charged legitimate professional services fees, though, which is okay. Consult an official at your Australian embassy or consulate if you want to make sure a payment is legitimate."
                    ]
                }
            ]
        },
        {
            "name": "Finding Jobs and Preparing Applications",
            "steps": []
        },
        {
            "name": "Applying for and Getting a Job",
            "steps": [
                {
                    "step": "4",
                    "title": "Plan to attend onsite interviews.",
                    "subtitle": " If you are called for interview, try to be in Australia to attend in person. Very few employers will engage candidates on an unseen basis, although you might suggest a videoconference (e.g. Skype) interview if you can’t be physically present. Remember to bring (or send along) copies of your work visa and references for employers to examine.",
                    "sub-points": [
                        "When it comes to interviews, Australian employers value punctuality, optimism, and the ability to provide concrete examples to illustrate a point. So be on time, upbeat and ready with examples!",
                        "They also like to gauge your personality by asking about your hobbies, strengths and weaknesses, and so on. Be yourself and show them how well you’ll fit in with their company."
                    ]
                },
                {
                    "step": "4",
                    "title": "Plan to attend onsite interviews.",
                    "subtitle": " If you are called for interview, try to be in Australia to attend in person. Very few employers will engage candidates on an unseen basis, although you might suggest a videoconference (e.g. Skype) interview if you can’t be physically present. Remember to bring (or send along) copies of your work visa and references for employers to examine.",
                    "sub-points": [
                        "When it comes to interviews, Australian employers value punctuality, optimism, and the ability to provide concrete examples to illustrate a point. So be on time, upbeat and ready with examples!",
                        "They also like to gauge your personality by asking about your hobbies, strengths and weaknesses, and so on. Be yourself and show them how well you’ll fit in with their company."
                    ]
                }
            ]
        }
    ]
}