{
    "link": "https://www.wikihow.com/Confront-a-Cheater",
    "article": "How to Confront a Cheater",
    "intro": "It is always painful to find out your partner is cheating. Infidelity is a major breach of trust and can be hard to confront. Before addressing the issue, make sure you have solid proof. Decide when and how you want to have the conversation. Try to remain calm. Express your feelings and decide, as a couple, where you want to go from here. If you decide to end the relationship, reach out to friends and family members for support. If you decide to stay, work on rebuilding trust between you and your partner.",
    "points": [
        {
            "name": "Deciding How to Confront Your Partner",
            "steps": [
                {
                    "step": "4",
                    "title": "Write down your thoughts.",
                    "subtitle": " It's very important to go into the conversation having a sense of what you want to say. You should write down your thoughts ahead of time. In difficult conversations, it can be hard to speak on the spot. If you formulate your thoughts ahead of time, this can help.",
                    "sub-points": [
                        "Think about what your feeling. What are the best ways to articulate this? How can you best make your feelings clear? Try to figure this out as you write and rewrite your thoughts on the page.",
                        "Also, consider what you want again. Do you have an end goal for the conversation? If so, include that here."
                    ]
                },
                {
                    "step": "4",
                    "title": "Write down your thoughts.",
                    "subtitle": " It's very important to go into the conversation having a sense of what you want to say. You should write down your thoughts ahead of time. In difficult conversations, it can be hard to speak on the spot. If you formulate your thoughts ahead of time, this can help.",
                    "sub-points": [
                        "Think about what your feeling. What are the best ways to articulate this? How can you best make your feelings clear? Try to figure this out as you write and rewrite your thoughts on the page.",
                        "Also, consider what you want again. Do you have an end goal for the conversation? If so, include that here."
                    ]
                }
            ]
        },
        {
            "name": "Having a Conversation",
            "steps": [
                {
                    "step": "5",
                    "title": "Address any reasons for infidelity.",
                    "subtitle": " Infidelity usually has some underlying cause. While no one needs to take all of the blame, there may have been an underlying issue with your relationship. You should discuss this to figure out how to best move forward. This is particularly important if you want to salvage the relationship.",
                    "sub-points": [
                        "Your partner may be hesitant to open up about why they cheated. Factors that lead to an affair are sensitive, and your partner may want to spare your feelings. However, underlying factors need to be addressed in a healthy fashion.",
                        "As you address the reasons for the affair, go in with the right mindset. Do not think of it as any one person taking the blame. The two of you are working, collaboratively, on what may have gone wrong and whether it can be fixed."
                    ]
                },
                {
                    "step": "5",
                    "title": "Address any reasons for infidelity.",
                    "subtitle": " Infidelity usually has some underlying cause. While no one needs to take all of the blame, there may have been an underlying issue with your relationship. You should discuss this to figure out how to best move forward. This is particularly important if you want to salvage the relationship.",
                    "sub-points": [
                        "Your partner may be hesitant to open up about why they cheated. Factors that lead to an affair are sensitive, and your partner may want to spare your feelings. However, underlying factors need to be addressed in a healthy fashion.",
                        "As you address the reasons for the affair, go in with the right mindset. Do not think of it as any one person taking the blame. The two of you are working, collaboratively, on what may have gone wrong and whether it can be fixed."
                    ]
                }
            ]
        },
        {
            "name": "Moving Forward",
            "steps": [
                {
                    "step": "5",
                    "title": "Consider therapy.",
                    "subtitle": " If you decide to move forward as a couple, counseling may help. A qualified counselor can help you work through your issues and get back to a healthy place in your relationship. Ask your doctor for a list of couples counselors in your area or get a list of providers from your insurance.",
                    "sub-points": [
                        "Try to find a counselor who has experience helping couples repair a relationship after infidelity."
                    ]
                }
            ]
        }
    ]
}