{
    "link": "https://www.wikihow.com/Use-Home-Remedies-to-Get-Rid-of-Gnats",
    "article": "How to Drive Away Gnats for Good: Easy DIY Methods",
    "intro": "While gnats aren’t necessarily harmful, they sure are annoying! Luckily, there are lots of ways to trap and exterminate these pests without having to resort to using expensive commercial products. Best of all, most of the supplies you need, you probably already have! Whether you've got an infestation on your hands, you're looking to prevent one from occurring, or you just want simple tips for keeping gnats away from you, keep reading: we've got everything you need to know!",
    "points": [
        {
            "name": "Dealing with Gnat Infestations ",
            "steps": []
        },
        {
            "name": "Removing Things That Attract Gnats ",
            "steps": [
                {
                    "step": "4",
                    "title": "Move potted plants with damp soil outdoors if they’re attracting gnats.",
                    "subtitle": " If you notice gnats congregating around your favorite houseplant, that might mean its soil is too damp and needs to dry out a little bit. Set it outside or in a garage or shed for a few days until the soil starts to dry out. If this doesn’t work, you may want to  in fresh soil.",
                    "sub-points": [
                        "On the flip side, there are a few plants that repel gnats. These can be potted and kept indoors, or you can plant them outside if you struggle with gnat infestations outdoors. Try , lemon thyme, lavender, and ; these are the best natural repellants."
                    ]
                }
            ]
        },
        {
            "name": "Keeping Gnats Away from Your Body ",
            "steps": [
                {
                    "step": "4",
                    "title": "Wear sunglasses and a bandana when walking through infested areas.",
                    "subtitle": " Sometimes, no matter how hard you try to avoid it, you might end up walking through a heavily infested gnat area. To keep them away from your eyes, mouth, and nose, wear a pair of sunglasses and  around your face. Once you’re away from the area, you can remove these items.",
                    "sub-points": [
                        "Gnats won’t harm you—they don’t bite or transmit diseases—but they are annoying and can ruin a nice day. Do your best to be prepared when you go outdoors, especially if you’ll be near still water sources."
                    ]
                }
            ]
        }
    ]
}