{
    "link": "https://www.wikihow.com/Emphasize-a-Word",
    "article": "How to Emphasize a Word",
    "intro": "Emphasizing a word can be a way to make your point clearer or highlight key terms or phrases. Whether you're emphasizing a word in writing or text, the process is fairly simple. In texts, things like bold and italics are usually used as emphasis. You can pause and elongate a word to emphasize it in speech. With some attention to detail, you can really make your point clear through emphasis.",
    "points": [
        {
            "name": "Emphasizing a Word in Text",
            "steps": [
                {
                    "step": "3",
                    "title": "Use exclamations points in informal or creative writing.",
                    "subtitle": " Exclamation points are generally used sparingly, even in creative works. However, in dialogue especially, they can be used on occasion for major emphasis. Exclamation points usually indicate a change in tone, so you can add them to scenes or moments in creative works that are meant to be particularly dramatic.",
                    "sub-points": [
                        "For example, you may use an exclamation point in a sentence like, \"She screamed as he made his way to the train platform, 'Stop and listen to me!'\"",
                        "Exclamation points can come off as melodramatic if they're overused, so stick to using exclamation points for very big moments. If you're using text as a visual aid, such as in a presentation, try to incorporate other forms of emphasis such as using a bigger or bolded font, changing the spacing around the word, or changing the color of the word."
                    ]
                },
                {
                    "step": "3",
                    "title": "Use exclamations points in informal or creative writing.",
                    "subtitle": " Exclamation points are generally used sparingly, even in creative works. However, in dialogue especially, they can be used on occasion for major emphasis. Exclamation points usually indicate a change in tone, so you can add them to scenes or moments in creative works that are meant to be particularly dramatic.",
                    "sub-points": [
                        "For example, you may use an exclamation point in a sentence like, \"She screamed as he made his way to the train platform, 'Stop and listen to me!'\"",
                        "Exclamation points can come off as melodramatic if they're overused, so stick to using exclamation points for very big moments. If you're using text as a visual aid, such as in a presentation, try to incorporate other forms of emphasis such as using a bigger or bolded font, changing the spacing around the word, or changing the color of the word."
                    ]
                }
            ]
        },
        {
            "name": "Emphasizing a Word in Speech",
            "steps": [
                {
                    "step": "4",
                    "title": "Repeat the word for extra emphasis.",
                    "subtitle": " It can sometimes help to repeat the word just once. This gives added emphasis to make sure your audience heard the key information.",
                    "sub-points": [
                        "For example, \"This new technique led to a 30% increase, a 30% increase, in sales this quarter.\""
                    ]
                }
            ]
        },
        {
            "name": "Avoiding Pitfalls",
            "steps": [
                {
                    "step": "4",
                    "title": "Practice emphasis for big presentations.",
                    "subtitle": " You should never go into a presentation without practicing your speech, including your use of emphasis. Practice in front of a mirror and in front of others. This will ensure you go into a speech confident and relaxed.",
                    "sub-points": [
                        "To help you remember which words to emphasize as you practice your speech, try bolding certain terms or using ellipses around them as a visual signal in your notes or script."
                    ]
                }
            ]
        }
    ]
}