{
    "link": "https://www.wikihow.com/Reject-a-Marriage-Proposal",
    "article": "How to Reject a Marriage Proposal",
    "intro": "The fairytale suggests that \"yes, oh, yes!\" is the only answer ever given to a proposal of marriage. But sometimes, marriage is not a good choice. There are many good reasons for rejecting a proposal: uncertainty that this is a solid marriage partner, not really knowing one another well enough, wondering if the person asking really means it, or that it is the timing is right. When it comes to a life decision, never say \"yes\" when you should say \"no\"; an honest response allows you both to make the best decision about the future.",
    "points": [
        {
            "name": "Deflecting an Upcoming Proposal",
            "steps": [
                {
                    "step": "5",
                    "title": "Consider the future.",
                    "subtitle": " If you and your partner have both gotten through the conversation (perhaps with help from a counselor), you've bought yourself some time. This is often exactly what you need, but use this time wisely. If it's just a question of reevaluating after finishing your education, you may be content just to see what happens. If you have doubts about the relationship itself, think carefully about , continue to discuss issues with your partner, and seek advice from a relationship counselor if necessary, or from non-judgmental friends who are in healthy relationships and who won't spread gossip.",
                    "sub-points": [
                        "If there are life events that would seriously pressure you to get married, spend time planning for this in advance. Some events you can do your best to avoid, such as pregnancy, while others you cannot control, such as a terminal illness in the family. Seeking advice and support is especially important in these situations, when you feel pressured to make a decision under stress.Do not make decisions because of another family member. Yes, Grandma would love to see you get married before she dies. But she does not have to live with the consequences of marrying the wrong person, at the wrong time, for the wrong reasons. And imagine how bad she would feel, knowing the reason for your (likely) divorce, was because she pressured you into the marriage.An out-of-wedlock and/or accidental pregnancy can be problematic. But getting married for the sake of the baby often ends poorly, too."
                    ]
                }
            ]
        },
        {
            "name": "Rejecting a Proposal",
            "steps": []
        }
    ]
}