{
    "link": "https://www.wikihow.com/Get-Air-Bubbles-Out-of-a-Glass-Screen-Protector",
    "article": "How to Get Air Bubbles Out of a Glass Screen Protector",
    "intro": "Screen protectors may help keep your electronics safe from cracks, but they can be pretty difficult to put on. If you ",
    "points": [
        {
            "name": "Reapplying the Screen Protector",
            "steps": [
                {
                    "step": "5",
                    "title": "Rub your finger or a credit card across the surface of your screen protector.",
                    "subtitle": " Once your screen protector adheres to the screen, press down with your finger or the edge of a credit card in the center of the screen. Push from the center of your screen to the outer edges to move air bubbles outward. Work around the entire screen until you press all the air bubbles out.",
                    "sub-points": [
                        "If there are still air bubbles on your screen, try reapplying it again or consider getting a new screen protector."
                    ]
                }
            ]
        },
        {
            "name": "Removing Air Bubbles around the Edges with Oil",
            "steps": [
                {
                    "step": "3",
                    "title": "Press the screen protector back down and wipe off any oil.",
                    "subtitle": " When your screen protector doesn’t have any air bubbles around the edge, squeeze it tight against the screen so it adheres firmly. Use a piece of paper towel to dry off the edges around your screen protector and clean any extra oil that was pushed out.",
                    "sub-points": [
                        "Put pressure around the edges of your screen protector to see if any oil comes out from underneath.",
                        "Use a lint-free cloth to remove any excess oil from your phone or tablet."
                    ]
                },
                {
                    "step": "3",
                    "title": "Press the screen protector back down and wipe off any oil.",
                    "subtitle": " When your screen protector doesn’t have any air bubbles around the edge, squeeze it tight against the screen so it adheres firmly. Use a piece of paper towel to dry off the edges around your screen protector and clean any extra oil that was pushed out.",
                    "sub-points": [
                        "Put pressure around the edges of your screen protector to see if any oil comes out from underneath.",
                        "Use a lint-free cloth to remove any excess oil from your phone or tablet."
                    ]
                }
            ]
        }
    ]
}