{
    "link": "https://www.wikihow.com/Ignoring-a-Narcissist",
    "article": "How to Ignore a Narcissist & How They’ll Respond",
    "intro": "Abusers may seem charming and polite at first, but what should you do when they start showing their true colors? Rather than giving them what they want and feeling drained, taking the power into your own hands and ignoring them is the best way to cut them off. When you ignore an abuser, you’re taking away their control, and they may respond differently depending on your relationship. If you’re nervous about how a person may react once you start ignoring them, don’t worry because we have you covered. Keep reading to find out how to start ignoring a manipulator and how you can expect them to respond afterward.",
    "points": [
        {
            "name": "What happens when you ignore an abuser?",
            "steps": [
                {
                    "step": "11",
                    "title": "They could try to sabotage you.",
                    "subtitle": " Some manipulators may get vengeful when things don’t go their way, so they’ll try to do things that block meaningful opportunities in your life. They may try to prevent you from moving up in your career, destroy personal belongings that are important to you, or may even act out violently.",
                    "sub-points": [
                        "If an abuser starts harassing you or turns violent, contact the authorities and let them know about the issue. Don’t try to get involved on your own so you don’t risk getting hurt."
                    ]
                }
            ]
        },
        {
            "name": "How to Ignore an Abuser ",
            "steps": []
        },
        {
            "name": "Can an abuser change?",
            "steps": [
                {
                    "step": "None",
                    "title": "An abuser may change if they see the negative impacts they’re causing.",
                    "subtitle": " If a manipulator sees that the relationships in their personal or professional lives are breaking down, they may see how their behavior negatively impacts people. While it may take a lot of motivation and effort for an abuser to completely change their ways, they can still manage their behaviors if they set their mind toward being more empathetic and understanding of others.",
                    "sub-points": [
                        "If a person works with a therapist, it’s a good sign they want to make a meaningful change. A therapist can help a person find the root cause of their behavior, challenge how they handle situations, and offer helpful insight to change how they interact with others."
                    ]
                }
            ]
        }
    ]
}