{
    "link": "https://www.wikihow.com/Use-a-Bidet",
    "article": "How to Use a Bidet",
    "intro": "If you're traveling through Europe, Latin America, the Middle East, or East Asia, chances are you'll eventually encounter a bidet in the bathroom. But what exactly are ",
    "points": [
        {
            "name": "Mounting the Bidet",
            "steps": [
                {
                    "step": "4",
                    "title": "Activate a  bidet.",
                    "subtitle": " Look for the “Wash” button on the bidet’s remote control, which is usually mounted on the wall next to the toilet. You may also find the button on the toilet itself. A nozzle will appear beneath you and rinse your nether regions with a stream of water.",
                    "sub-points": [
                        "When you're done, simply press the “Stop” button. The nozzle will rinse itself off and retract back into the seat.",
                        "In mechanically controlled add-on bidets, you just turn the lever or pull a string and turn the mains valve."
                    ]
                },
                {
                    "step": "4",
                    "title": "Activate a  bidet.",
                    "subtitle": " Look for the “Wash” button on the bidet’s remote control, which is usually mounted on the wall next to the toilet. You may also find the button on the toilet itself. A nozzle will appear beneath you and rinse your nether regions with a stream of water.",
                    "sub-points": [
                        "When you're done, simply press the “Stop” button. The nozzle will rinse itself off and retract back into the seat.",
                        "In mechanically controlled add-on bidets, you just turn the lever or pull a string and turn the mains valve."
                    ]
                }
            ]
        },
        {
            "name": "Cleaning Yourself",
            "steps": [
                {
                    "step": "3",
                    "title": "Clean your rear and/or your genitals.",
                    "subtitle": " If you're using a bidet with a jet, then you can mostly let the force of the water do its work. If you're using a basin, then you'll need to get your hands dirty. Either way, you might consider using your wet hands to \"scrub\" the area clean more quickly. You can always  afterwards!",
                    "sub-points": [
                        "Consider combining the bidet with toilet paper. You can use the paper at the end, to finish the job, or you can dampen the toilet paper in the water and use it to wipe yourself clean."
                    ]
                }
            ]
        },
        {
            "name": "Following Up",
            "steps": []
        }
    ]
}