{
    "link": "https://www.wikihow.com/Identify-Bed-Bug-Droppings",
    "article": "How to Identify Bed Bug Droppings",
    "intro": "If you’ve woken up with itchy red bites all over your arms or legs, you might be looking at a bed bug infestation. One of the best ways to ID pests is to look for their droppings—and since bed bugs are so small, searching for their feces is a great way to double check which pest you’re dealing with. Keep reading to learn how you can tell whether or not you have bed bugs in your home to start treating them today.",
    "points": [
        {
            "name": "Look for reddish-brown, rust-colored stains.",
            "steps": [
                {
                    "step": "None",
                    "title": "Bed bug droppings are mostly digested blood.",
                    "subtitle": " As you’re checking for bed bug feces, it might look red, reddish-brown, or muddy brown. Old feces will generally look darker, while new feces could be bright red. Bed bug feces is the consistency of soft mud.",
                    "sub-points": [
                        "If you're having trouble seeing the color of the feces, try doing the smear test. Take a baby wipe or an alcohol swab and gently wipe the feces up. If the color on the wipe is red or reddish-brown, then it's probably from a bed bug.",
                        "As you look around, be sure to check the seams of your mattress, box spring frames, behind your headboard, and along any baseboards in the room."
                    ]
                },
                {
                    "step": "None",
                    "title": "Bed bug droppings are mostly digested blood.",
                    "subtitle": " As you’re checking for bed bug feces, it might look red, reddish-brown, or muddy brown. Old feces will generally look darker, while new feces could be bright red. Bed bug feces is the consistency of soft mud.",
                    "sub-points": [
                        "If you're having trouble seeing the color of the feces, try doing the smear test. Take a baby wipe or an alcohol swab and gently wipe the feces up. If the color on the wipe is red or reddish-brown, then it's probably from a bed bug.",
                        "As you look around, be sure to check the seams of your mattress, box spring frames, behind your headboard, and along any baseboards in the room."
                    ]
                }
            ]
        },
        {
            "name": "Check for small droppings, the size of the tip of a pen.",
            "steps": [
                {
                    "step": "None",
                    "title": "Bed bugs are small, so their droppings are small, too.",
                    "subtitle": " Each individual dropping will only be about as big as the tip of a ballpoint pen. Bed bugs tend to gather together as they digest their meals, so you’ll probably see lots of droppings located together in one spot. However, if you only see one or two stains, it could still be bed bugs.",
                    "sub-points": [
                        "It might be helpful to use a magnifying glass when you search for bed bugs or their droppings."
                    ]
                }
            ]
        },
        {
            "name": "Look for smears, similar to an ink stain.",
            "steps": [
                {
                    "step": "None",
                    "title": "Bed bug droppings are soft, and tend to smear onto whatever they touch.",
                    "subtitle": " At first glance, their feces might look like an ink stain from a ballpoint pen, especially if it’s on your mattress or your sheets. If the droppings are old, they might even soak into your mattress or sheets completely, leaving a dark stain.",
                    "sub-points": [
                        "Experts describe bed bug feces as similar to letting a ballpoint pen leak for a while, then drying into a stain."
                    ]
                }
            ]
        },
        {
            "name": "Look along the mattress seam and the tag.",
            "steps": [
                {
                    "step": "None",
                    "title": "This is the most common spot you’ll see bed bugs.",
                    "subtitle": " Carefully lift up your mattress and look along the seam and on the mattress tag. Bed bugs like to hide in dark places, so they may be tucked into a corner or even underneath your mattress. Look for large congregations of droppings, as bed bugs generally like to stick together.",
                    "sub-points": [
                        "Bed bug feces is sometimes mistaken for mold or mildew, especially on a mattress. However, if you look closely, you’ll be able to see the reddish-brown color instead of pure black."
                    ]
                }
            ]
        },
        {
            "name": "Check the wood frame of the box spring and the headboard.",
            "steps": [
                {
                    "step": "None",
                    "title": "Sometimes, bed bugs will hide in your bed frame instead of your bed.",
                    "subtitle": " If you couldn’t find any in your mattress, start checking in the crevices of your box spring frame and behind the headboard. Use a flashlight to look into dark areas, and don’t be afraid to lift up your mattress and check underneath it.",
                    "sub-points": [
                        "If you are squeamish about touching bed bugs or their feces, wear gloves as you search."
                    ]
                }
            ]
        },
        {
            "name": "Look along ceiling and wall junctions.",
            "steps": [
                {
                    "step": "None",
                    "title": "Bed bugs will sometimes hide in your walls, not your bed.",
                    "subtitle": " If you can’t find any bed bugs in your mattress or bed frame, start looking along your ceiling, your baseboards, and in the corners. Remember that bed bugs like to hide out in dark places, so they might be tucked behind a piece of furniture or in a quiet corner somewhere.",
                    "sub-points": [
                        "If the bed bug droppings are dry on a wall, they might look crunchy and slightly brown-colored."
                    ]
                }
            ]
        },
        {
            "name": "Check behind electrical outlets and curtain rods.",
            "steps": [
                {
                    "step": "None",
                    "title": "Grab a screwdriver so you can unscrew the electrical outlets nearby.",
                    "subtitle": " Bed bugs sometimes nest behind electrical outlets or underneath the corners of curtain rods. If you think that the bed bugs are deep inside a crevice somewhere, you can use tweezers or a pen to poke and prod the holes and drive them out. Use caution around electrical outlets, and never stick anything inside of them.",
                    "sub-points": [
                        "Bed bugs can stay hidden easily, but their feces is usually a little more prominent. You might see reddish-brown smears strewn around your outlets or near your curtain rod."
                    ]
                }
            ]
        },
        {
            "name": "Touch the droppings to feel how smooth they are.",
            "steps": []
        },
        {
            "name": "Smell the droppings to see if they smell like rust.",
            "steps": []
        },
        {
            "name": "Look for shed skin and dead bugs around the feces.",
            "steps": [
                {
                    "step": "None",
                    "title": "You can sometimes find a lot of bed bugs surrounding their droppings.",
                    "subtitle": " If you stumble upon a large congregation of feces, you can be sure that it’s from bed bugs if you find dead bed bugs or small, rolled up pieces of shed skin. You probably won’t be able to see their eggs, because they’re pretty small.",
                    "sub-points": [
                        "Bed bugs have small, flat, oval-shaped bodies. They don’t have any wings, and they are usually reddish-brown in color.",
                        "Bed bug eggs are usually around the size of a pinhead."
                    ]
                },
                {
                    "step": "None",
                    "title": "You can sometimes find a lot of bed bugs surrounding their droppings.",
                    "subtitle": " If you stumble upon a large congregation of feces, you can be sure that it’s from bed bugs if you find dead bed bugs or small, rolled up pieces of shed skin. You probably won’t be able to see their eggs, because they’re pretty small.",
                    "sub-points": [
                        "Bed bugs have small, flat, oval-shaped bodies. They don’t have any wings, and they are usually reddish-brown in color.",
                        "Bed bug eggs are usually around the size of a pinhead."
                    ]
                }
            ]
        },
        {
            "name": "Avoid checking pets or pet bedding.",
            "steps": [
                {
                    "step": "None",
                    "title": "If you see dark black droppings on your pet, they probably have fleas.",
                    "subtitle": " Fleas and bed bugs often get mixed up, so it’s important to double check before starting treatment. Fleas also poop mostly blood, and can drop reddish-brown feces on your pets or their bedding. However, bed bugs usually don’t congregate near animals, and their droppings are slightly bigger than flea droppings are.",
                    "sub-points": [
                        "The best way to get a positive bed bug identification is to bring an expert in.",
                        "If you do have a flea infestation, start treating the source by giving flea medicine to your pets. You can also wash their bedding with hot water to kill any fleas or eggs that might be living there."
                    ]
                },
                {
                    "step": "None",
                    "title": "If you see dark black droppings on your pet, they probably have fleas.",
                    "subtitle": " Fleas and bed bugs often get mixed up, so it’s important to double check before starting treatment. Fleas also poop mostly blood, and can drop reddish-brown feces on your pets or their bedding. However, bed bugs usually don’t congregate near animals, and their droppings are slightly bigger than flea droppings are.",
                    "sub-points": [
                        "The best way to get a positive bed bug identification is to bring an expert in.",
                        "If you do have a flea infestation, start treating the source by giving flea medicine to your pets. You can also wash their bedding with hot water to kill any fleas or eggs that might be living there."
                    ]
                }
            ]
        },
        {
            "name": "Kill bed bugs with heat or steam.",
            "steps": [
                {
                    "step": "None",
                    "title": "If you’re positive that you have bed bugs, start  right away.",
                    "subtitle": " Wash all of your bedding on high heat, and take a hair dryer to any areas you can’t wash, like walls or windows. You can also use a steam cleaner to get into cracks and crevices that you can’t reach. Eradicating bed bugs can take a long time (sometimes up to a year), so check back every day to see whether the bugs are still there or not.",
                    "sub-points": [
                        "If DIY methods don’t work, consider calling a professional. They can use chemical treatments to treat your home and kill the bed bugs quickly."
                    ]
                }
            ]
        }
    ]
}