{
    "link": "https://www.wikihow.com/Apply-Makeup-for-Beginners",
    "article": "An Absolute Beginners' Guide to Applying Makeup Like a Pro",
    "intro": "Makeup can be a fabulous way to express your creativity and polish your look, and can even be therapeutic! Beginner makeup is as simple as can be and doesn’t require any special skills or previous knowledge to turn out great. In this article, we’ll teach you all about what products to use and when and how to apply them, so you’ll be rocking a fresh and glowy makeup look in no time. Read on for a fabulous full-face!",
    "points": [
        {
            "name": "Skin Prep & Applying Your Base",
            "steps": [
                {
                    "step": "5",
                    "title": "Set the concealer and foundation with a .",
                    "subtitle": " Carefully dip your powder brush into your translucent face powder, tapping the brush on the side of the container to remove any excess product. Make sure you’ve blended enough to where there’s no visible residue left over on your face.",
                    "sub-points": [
                        "Translucent powder reduces oil-causing shine and locks in your makeup so that it lasts all day."
                    ]
                }
            ]
        },
        {
            "name": "Applying Eyeshadow, Eyeliner, & Mascara",
            "steps": [
                {
                    "step": "4",
                    "title": " a coat of mascara.",
                    "subtitle": " Apply your  to the upper and lower lashes with the wand's tip oriented towards the outer corner of your eye, wiggling your brush from root to tip. One coat is enough for a natural look, but you can layer up if you’re looking for some extra drama.",
                    "sub-points": [
                        "Don’t worry about getting any on your eyelid. Just let it dry, and clean it up later with a q-tip.",
                        "Keep in mind that the more coats of mascara you apply, the more likely it is to get clumpy or spidery."
                    ]
                },
                {
                    "step": "4",
                    "title": " a coat of mascara.",
                    "subtitle": " Apply your  to the upper and lower lashes with the wand's tip oriented towards the outer corner of your eye, wiggling your brush from root to tip. One coat is enough for a natural look, but you can layer up if you’re looking for some extra drama.",
                    "sub-points": [
                        "Don’t worry about getting any on your eyelid. Just let it dry, and clean it up later with a q-tip.",
                        "Keep in mind that the more coats of mascara you apply, the more likely it is to get clumpy or spidery."
                    ]
                }
            ]
        },
        {
            "name": "Adding Cheek and Lip Color",
            "steps": []
        }
    ]
}