{
    "link": "https://www.wikihow.com/Close-a-Bag-of-Chips-by-Folding-It",
    "article": "How to Close a Bag of Chips by Folding It",
    "intro": "If you don’t have a bag clip, you have a few options when it comes to keeping your chips fresh. The easiest way to do this is to fold the top of the bag over itself multiple times after forcing the excess air out. If you do this, store your chips with the folds facing down and place a heavy object over the folds to keep the bag sealed. Another option is to fold the corners towards the middle of the bag before folding a few layers on top of the corners. Then, stick your thumbs in the corner folds and turn them over the top of the bag to ",
    "points": [
        {
            "name": "Creating a Simple Fold",
            "steps": [
                {
                    "step": "4",
                    "title": "Store the bag upside down on top of itself.",
                    "subtitle": " Take your bag and flip it upside down so that the folds are on the bottom of the bag. Your bag of chips should stay folded automatically. To keep the folds from unraveling over time, place a vase, bowl, or something heavy on top of the folds to keep them weighed down.",
                    "sub-points": [
                        "Your folds may slowly come undone if you don’t weigh them down at all."
                    ]
                }
            ]
        },
        {
            "name": "Making a Stronger Fold",
            "steps": [
                {
                    "step": "5",
                    "title": "Stick your thumbs into the corner flaps and invert the top of the bag.",
                    "subtitle": " To seal the bag, hold the folds at the top of the bag down with your index, middle, ring, and pinky fingers. Insert your thumbs between the corners and the bag. Lift the bag up and push your folds down while pulling the corners up to invert the top of the bag and close it on itself.",
                    "sub-points": [
                        "Essentially, the tension between the corners and the folds at the top will keep the bag sealed."
                    ]
                }
            ]
        }
    ]
}