{
    "link": "https://www.wikihow.com/Gleek",
    "article": "How to Gleek",
    "intro": "Gleeking is the act of shooting saliva out from under your tongue. Many people have gleeked on accident when ",
    "points": [
        {
            "name": "Shooting Spit",
            "steps": [
                {
                    "step": "6",
                    "title": "Open your mouth and push your bottom jaw out.",
                    "subtitle": " Open your mouth as wide as you comfortably can and extend your lower jaw away from you and towards your target. Flex the muscles in your tongue as hard as you can while doing this. With enough practice, you will naturally shoot out a stream of saliva from the gland beneath your tongue.",
                    "sub-points": [
                        "It may be tempting to try and purse your lips together, since that’s what most people do when they normally . This will block the gland at the bottom of your tongue though, so try to avoid doing it while you gleek.",
                        "Keep your tongue locked to the roof of your mouth while you’re doing this."
                    ]
                },
                {
                    "step": "6",
                    "title": "Open your mouth and push your bottom jaw out.",
                    "subtitle": " Open your mouth as wide as you comfortably can and extend your lower jaw away from you and towards your target. Flex the muscles in your tongue as hard as you can while doing this. With enough practice, you will naturally shoot out a stream of saliva from the gland beneath your tongue.",
                    "sub-points": [
                        "It may be tempting to try and purse your lips together, since that’s what most people do when they normally . This will block the gland at the bottom of your tongue though, so try to avoid doing it while you gleek.",
                        "Keep your tongue locked to the roof of your mouth while you’re doing this."
                    ]
                }
            ]
        },
        {
            "name": "Honing Your Skills",
            "steps": [
                {
                    "step": "5",
                    "title": "Try gleeking in front of a mirror to see how you’re doing it.",
                    "subtitle": " It may be easier to improve if you study what you look like in the mirror when you try to gleek. Compare your attempts at gleeking to what it looks like when other people do it. Just be sure to clean off your mirror if you happen to spit on it!",
                    "sub-points": [
                        "Never gleek on other people. Gleeking is a neat trick to show your friends, but it isn’t something you want to do to another person."
                    ]
                }
            ]
        }
    ]
}