{
    "link": "https://www.wikihow.com/Make-Your-Fingernails-Look-Good",
    "article": "How to Get Good Looking Nails Fast: Expert Tips",
    "intro": "Hangnails, torn nails, and nail ridges—oh my! With so many things that can make our nails look a little, well… unkempt, it’s a wonder that nail care isn’t a full time job. Fortunately, keeping your nails in tip top shape is easy, and all it requires is the right products and a little know-how. Keep reading to learn the best ways to care for your nails, as well as which foods to go for to strengthen your nails from the inside out.",
    "points": [
        {
            "name": "Caring for Your Nails",
            "steps": [
                {
                    "step": "8",
                    "title": "Scrub beneath your nails with soap and water as needed.",
                    "subtitle": " Avoid picking out dirt and other gunk from your nails with anything pointy, like a metal tool. If you do this on a regular basis, you could cause your nail plate to separate from the nail bed. Instead, wash your hands as needed, using gentle motions to scrub beneath your nails.",
                    "sub-points": [
                        "Don’t wash your hands too vigorously. If you scrub a lot beneath your nails, you can still do damage to your nail beds."
                    ]
                }
            ]
        },
        {
            "name": "Maintaining a Healthy Diet",
            "steps": [
                {
                    "step": "4",
                    "title": "Prevent brittle nails by eating a lot of zinc.",
                    "subtitle": " Opt for cashews, oysters, lobster, lean beef, soybeans, and green beans as a remedy for weak nails. If you’d like a more concentrated dose of zinc, try taking .",
                    "sub-points": [
                        "If you eat a lot of zinc-rich foods on a regular basis, you don’t need to worry about taking supplements. Always talk to your doctor before adding supplements to your diet."
                    ]
                }
            ]
        },
        {
            "name": "Getting a Fun Manicure",
            "steps": [
                {
                    "step": "4",
                    "title": " to add some shimmer to your nails.",
                    "subtitle": " Opt for a beautiful, low-maintenance manicure by requesting a dip powder manicure at your next salon visit. Unlike gel and acrylic manicures, you don’t need to rest dipped nails beneath a UV light.",
                    "sub-points": [
                        "Dip powder nails are a lot easier to remove than regular nails."
                    ]
                }
            ]
        }
    ]
}