{
    "link": "https://www.wikihow.com/Dodge-That-Bullet",
    "article": "What Does \"Dodge a Bullet\" Mean?",
    "intro": "You’re not a soldier, spy, or criminal, so why do people keep saying you “dodged a bullet”? Is it good or bad to “dodge a bullet”? It can be hard to figure out what this tricky English expression means, but we’ve got you covered! Keep reading for an explanation of the phrase, ways to use “dodge a bullet”, and related phrases!",
    "points": [
        {
            "name": "What does it mean to “dodge a bullet”?",
            "steps": [
                {
                    "step": "None",
                    "title": "To “dodge a bullet” means to avoid an undesirable event.",
                    "subtitle": " This is an informal idiom that you might use after you’ve narrowly avoided an injury or accident to express relief. It’s a positive thing if someone says you’ve “dodged a bullet”!",
                    "sub-points": [
                        "This expression was first used literally in the early 20th century to describe someone who had avoided being shot in combat. The phrase took on a non-literal meaning in the second half of the 20th century."
                    ]
                }
            ]
        },
        {
            "name": "Ways to Use “Dodge a Bullet”",
            "steps": []
        },
        {
            "name": "Related Phrases",
            "steps": [
                {
                    "step": "2",
                    "title": "A “narrow escape” also means to have averted danger.",
                    "subtitle": " To “narrowly escape” is to have barely avoided a dangerous situation. This expression is very similar to “close call” and is another phrase you might hear said with, or in place of, “dodge a bullet”.",
                    "sub-points": [
                        "You: “I almost tripped down the stairs, but I caught myself on the railing.”",
                        "Your friend: “You narrowly escaped falling down a whole flight of stairs then!”"
                    ]
                },
                {
                    "step": "2",
                    "title": "A “narrow escape” also means to have averted danger.",
                    "subtitle": " To “narrowly escape” is to have barely avoided a dangerous situation. This expression is very similar to “close call” and is another phrase you might hear said with, or in place of, “dodge a bullet”.",
                    "sub-points": [
                        "You: “I almost tripped down the stairs, but I caught myself on the railing.”",
                        "Your friend: “You narrowly escaped falling down a whole flight of stairs then!”"
                    ]
                }
            ]
        }
    ]
}