{
    "link": "https://www.wikihow.com/Tell-What-Animal-Is-in-My-Wall",
    "article": "Do You Have Animals in Your Walls? Dealing with Animals in Your Walls or Attic",
    "intro": "If random noises are keeping you up at night or holes in your drywall have you worried, you may have a pest living in your walls. Identifying which creature you’re dealing with will save your pest control expert a lot of guesswork, and you may even be able to scare the critter off on your own depending on who the culprit is. In this article, we’ll cover all of the usual suspects when it comes to creatures coming into your walls and break down what you can do to remove them (and prevent the problem in the future).",
    "points": [
        {
            "name": "Possible Animal Intruders",
            "steps": [
                {
                    "step": "8",
                    "title": "Insects",
                    "subtitle": " If you hear a constant buzzing sound and you simply can’t figure out where it’s coming from, you may have wasps or some other insect building a home inside of your walls. Go outside and look at the exterior wall where the sound is coming from. If you see an unusual number of bugs flying around the area, you very likely have insects in your wall.",
                    "sub-points": [
                        "If your drywall or flooring starts to randomly appear damaged, you may have termites.",
                        "The exception here is ants. Ants are extremely unlikely to make noise, but you’ll see them inside of your home."
                    ]
                },
                {
                    "step": "8",
                    "title": "Insects",
                    "subtitle": " If you hear a constant buzzing sound and you simply can’t figure out where it’s coming from, you may have wasps or some other insect building a home inside of your walls. Go outside and look at the exterior wall where the sound is coming from. If you see an unusual number of bugs flying around the area, you very likely have insects in your wall.",
                    "sub-points": [
                        "If your drywall or flooring starts to randomly appear damaged, you may have termites.",
                        "The exception here is ants. Ants are extremely unlikely to make noise, but you’ll see them inside of your home."
                    ]
                }
            ]
        },
        {
            "name": "How to Get Animals Out of Your Walls",
            "steps": [
                {
                    "step": "2",
                    "title": "Cover up entryways to prevent the problem in the future.",
                    "subtitle": " Make it hard for pests to enter and they’ll look elsewhere for shelter. If you have any openings or gaps in your roof, get them repaired to . Fix loose siding and cut any tree branches that hang over your home so critters can’t climb on to your building. Store your garbage in a closed container far away from your home and keep your living space clean to deter pests.",
                    "sub-points": [
                        "As fun as it can be to watch birds in your garden, bird baths and bird feeders attract raccoons, squirrels, and other wildlife.",
                        "The animals that might end up in your walls are all creatures who prefer the path of least resistance. If getting into your home is difficult, they aren’t going to bother."
                    ]
                },
                {
                    "step": "2",
                    "title": "Cover up entryways to prevent the problem in the future.",
                    "subtitle": " Make it hard for pests to enter and they’ll look elsewhere for shelter. If you have any openings or gaps in your roof, get them repaired to . Fix loose siding and cut any tree branches that hang over your home so critters can’t climb on to your building. Store your garbage in a closed container far away from your home and keep your living space clean to deter pests.",
                    "sub-points": [
                        "As fun as it can be to watch birds in your garden, bird baths and bird feeders attract raccoons, squirrels, and other wildlife.",
                        "The animals that might end up in your walls are all creatures who prefer the path of least resistance. If getting into your home is difficult, they aren’t going to bother."
                    ]
                }
            ]
        },
        {
            "name": "Signs Animals Are in Your Walls",
            "steps": []
        }
    ]
}